{
  "psalms_media": [
    {
      "psalm": 3,
      "title": "Psalm 3 | \"Yahweh, how are they increased that trouble me!\"",
      "date": "April 10th, 2026",
      "location": "Central Colorado",
      "time_of_day": "Evening",
      "image": "/images/thumbs/Psalms-3-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/O7OLEB5rrFc",
      "audioUrl": "/audio/Psalm-3.mp3",
      "length": "2:05",
      "description": "<br>1 Yahweh, how are they increased that trouble me! many are they that rise up against me.<br>2 Many there be which say of my soul, There is no help for him in Elohim. Selah.<br>3 But thou, O Yahweh, art a shield for me; my glory, and the lifter up of mine head.<br>4 I cried unto Yahweh with my voice, and he heard me out of his holy hill. Selah.<br>5 I laid me down and slept; I awaked; for Yahweh sustained me.<br>6 I will not be afraid of ten thousands of people, that have set themselves against me round about.<br>7 Arise, O Yahweh; save me, O my Elohim: for thou hast smitten all mine enemies upon the cheek bone; thou hast broken the teeth of the wicked.<br>8 Salvation belongeth unto Yahweh: thy blessing is upon thy people. Selah.<br>"
    },
   {
      "psalm": 4,
      "title": "Psalm 4 | Victories of sinners are only temporary",
      "date": "Mar. 25th, 2026",
      "location": "Southwestern South Dakota",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-4-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/5A9yTIzRST8",
      "audioUrl": "/audio/Psalm-4.mp3",
      "length": "1:18",
      "description": "<br>1 Hear me when I call, O Elohim of my righteousness: thou hast enlarged me when I was in distress; have mercy upon me, and hear my prayer.<br>2 O ye sons of men, how long will ye turn my glory into shame? how long will ye love vanity, and seek after leasing? Selah.<br>3 But know that Yahweh hath set apart him that is holy for himself: Yahweh will hear when I call unto him.<br>4 Stand in awe, and sin not: commune with your own heart upon your bed, and be still. Selah.<br>5 Offer the sacrifices of righteousness, and put your trust in Yahweh.<br>6 There be many that say, Who will shew us any good? Yahweh, lift thou up the light of thy countenance upon us.<br>7 Thou hast put gladness in my heart, more than in the time that their corn and their wine increased.<br>8 I will both lay me down in peace, and sleep: for thou, Yahweh, only makest me dwell in safety.<br>"
    },
    {
      "psalm": 5,
      "title": "Psalm 5 | A Prayer for Guidance",
      "date": "Nov. 1st, 2025",
      "location": "Northern Oregon",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-5-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/nrN0OA1TPgQ",
      "audioUrl": "/audio/Psalm-5.mp3",
      "length": "2:05",
      "description": "<br>1 Give ear to my words, O Yahweh, consider my meditation.<br>2 Hearken unto the voice of my cry, my King, and my Elohim: for unto thee will I pray.<br>3 My voice shalt thou hear in the morning, O Yahweh; in the morning will I direct my prayer unto thee, and will look up.<br>4 For thou art not a Elohim that hath pleasure in wickedness: neither shall evil dwell with thee.<br>5 The foolish shall not stand in thy sight: thou hatest all workers of iniquity.<br>6 Thou shalt destroy them that speak leasing: Yahweh will abhor the bloody and deceitful man.<br>7 But as for me, I will come into thy house in the multitude of thy mercy: and in thy fear will I worship toward thy holy temple.<br>8 Lead me, O Yahweh, in thy righteousness because of mine enemies; make thy way straight before my face.<br>9 For there is no faithfulness in their mouth; their inward part is very wickedness; their throat is an open sepulchre; they flatter with their tongue.<br>10 Destroy thou them, O Elohim; let them fall by their own counsels; cast them out in the multitude of their transgressions; for they have rebelled against thee.<br>11 But let all those that put their trust in thee rejoice: let them ever shout for joy, because thou defendest them: let them also that love thy name be joyful in thee.<br>12 For thou, Yahweh, wilt bless the righteous; with favour wilt thou compass him as with a shield."
    },
    {
      "psalm": 7,
      "title": "Psalm 7 | Righteousness will prevail",
      "date": "Dec. 10th, 2025",
      "location": "Southern Missouri",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-7-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/8ST0KGDyGNI",
      "audioUrl": "/audio/Psalm-7.mp3",
      "length": "2:34",
      "description": "1 O Yahweh my Elohim, in thee do I put my trust: save me from all them that persecute me, and deliver me:<br>2 Lest he tear my soul like a lion, rending it in pieces, while there is none to deliver.<br>3 O Yahweh my Elohim, If I have done this; if there be iniquity in my hands;<br>4 If I have rewarded evil unto him that was at peace with me; (yea, I have delivered him that without cause is mine enemy:)<br>5 Let the enemy persecute my soul, and take it; yea, let him tread down my life upon the earth, and lay mine honour in the dust. Selah.<br>6 Arise, O Yahweh, in thine anger, lift up thyself because of the rage of mine enemies: and awake for me to the judgment that thou hast commanded.<br>7 So shall the congregation of the people compass thee about: for their sakes therefore return thou on high.<br>8 Yahweh shall judge the people: judge me, O Yahweh, according to my righteousness, and according to mine integrity that is in me.<br>9 Oh let the wickedness of the wicked come to an end; but establish the just: for the righteous Elohim trieth the hearts and reins.<br>10 My defence is of Elohim, which saveth the upright in heart.<br>11 Elohim judgeth the righteous, and El is angry with the wicked every day.<br>12 If he turn not, he will whet his sword; he hath bent his bow, and made it ready.<br>13 He hath also prepared for him the instruments of death; he ordaineth his arrows against the persecutors.<br>14 Behold, he travaileth with iniquity, and hath conceived mischief, and brought forth falsehood.<br>15 He made a pit, and digged it, and is fallen into the ditch which he made.<br>16 His mischief shall return upon his own head, and his violent dealing shall come down upon his own pate.<br>17 I will praise the Yahweh according to his righteousness: and will sing praise to the name of the Yahweh most high.<br>"
    },
    {
      "psalm": 10,
      "title": "Psalm 10 | \"Thou hast heard the desire of the humble\"",
      "date": "Dec. 19th, 2025",
      "location": "Southwestern South Dakota",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-10-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/r1mwVp2W7yE",
      "audioUrl": "/audio/Psalm-10.mp3",
      "length": "2:59",
      "description": "<br>1 Why standest thou afar off, O Yahweh? why hidest thou thyself in times of trouble?<br>2 The wicked in his pride doth persecute the poor: let them be taken in the devices that they have imagined.<br>3 For the wicked boasteth of his heart's desire, and blesseth the covetous, whom Yahweh abhorreth.<br>4 The wicked, His mouth is full of cursing and deceit and fraud: under his tongue is mischief and vanity.<br>8 He sitteth in the lurking places of the villages: in the secret places doth he murder the innocent: his eyes are privily set against the poor.<br>9 He lieth in wait secretly as a lion in his den: he lieth in wait to catch the poor: he doth catch the poor, when he draweth him into his net.<br>10 He croucheth, and humbleth himself, that the poor may fall by his strong ones.<br>11 He hath said in his heart, El hath forgotten: he hideth his face; he will never see it.<br>12 Arise, O Yahweh; O Elohim, lift up thine hand: forget not the humble.<br>13 Wherefore doth the wicked contemn Elohim? he hath said in his heart, Thou wilt not require it.<br>14 Thou hast seen it; for thou beholdest mischief and spite, to requite it with thy hand: the poor committeth himself unto thee; thou art the helper of the fatherless.<br>15 Break thou the arm of the wicked and the evil man: seek out his wickedness till thou find none.<br>16 Yahweh is King for ever and ever: the heathen are perished out of his land.<br>17 Yahweh, thou hast heard the desire of the humble: thou wilt prepare their heart, thou wilt cause thine ear to hear:<br>18 To judge the fatherless and the oppressed, that the man of the earth may no more oppress.<br>"
    },
    {
      "psalm": 13,
      "title": "Psalm 13 | The \"How long?\" Psalm",
      "date": "Feb. 11th, 2024",
      "location": "Central Minnesota",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-13-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/IMaHSiAI30Y",
      "audioUrl": "/audio/Psalm-13.mp3",
      "length": "1:18",
      "description": "We filmed this reading on a foggy and frosty afternoon in the countryside of Minnesota. The combination of the thick fog and frost on the grass adds a unique feel. We hope you are blessed by this reading.<br><br>1 How long wilt thou forget me, O Yahweh? for ever?<br>how long wilt thou hide thy face from me?<br>2 How long shall I take counsel in my soul,<br>having sorrow in my heart daily?<br>how long shall mine enemy be exalted over me?<br>3 Consider and hear me, O Yahweh my Elohim:<br>lighten mine eyes, lest I sleep the sleep of death;<br>4 lest mine enemy say, I have prevailed against him;<br>and those that trouble me rejoice when I am moved.<br>5 But I have trusted in thy mercy;<br>my heart shall rejoice in thy salvation.<br>6 I will sing unto Yahweh,<br>because he hath dealt bountifully with me."
    },
    {
      "psalm": 14,
      "title": "Psalm 14 | \"The fool hath said in his heart, There is no Elohim\"",
      "date": "Nov. 16th, 2025",
      "location": "Southwestern South Dakota",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-14-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/Zrr-xKnzG_8",
      "audioUrl": "/audio/Psalm-14.mp3",
      "length": "1:14",
      "description": "1 The fool hath said in his heart, There is no Elohim. They are corrupt, they have done abominable works, there is none that doeth good.<br>2 Yahweh looked down from heaven upon the children of men, to see if there were any that did understand, and seek Elohim.<br>3 They are all gone aside, they are all together become filthy: there is none that doeth good, no, not one.<br>4 Have all the workers of iniquity no knowledge? who eat up my people as they eat bread, and call not upon Yahweh.<br>5 There were they in great fear: for Elohim is in the generation of the righteous.<br>6 Ye have shamed the counsel of the poor, because Yahweh is his refuge.<br>7 Oh that the salvation of Israel were come out of Zion! when Yahweh bringeth back the captivity of his people, Jacob shall rejoice, and Israel shall be glad."
    },
    {
      "psalm": 15,
      "title": "Psalm 15 | \"Who shall abide in thy tabernacle?\"",
      "date": "Nov. 5th, 2025",
      "location": "Southwestern South Dakota",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-15-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/rDDYa4RxtNU",
      "audioUrl": "/audio/Psalm-15.mp3",
      "length": "1:08",
      "description": "1 Yahweh, who shall abide in thy tabernacle? who shall dwell in thy holy hill?<br>2 He that walketh uprightly, and worketh righteousness, and speaketh the truth in his heart.<br>3 He that backbiteth not with his tongue, nor doeth evil to his neighbour, nor taketh up a reproach against his neighbour.<br>4 In whose eyes a vile person is contemned; but he honoureth them that fear Yahweh. He that sweareth to his own hurt, and changeth not.<br>5 He that putteth not out his money to usury, nor taketh reward against the innocent. He that doeth these things shall never be moved."
    },
    {
      "psalm": 16,
      "title": "Psalm 16 | \"Preserve me, O Elohim\"",
      "date": "Nov. 12th, 2025",
      "location": "Northwestern Oregon",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-16-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/s0CoLs8vs80",
      "audioUrl": "/audio/Psalm-16.mp3",
      "length": "1:43",
      "description": "1 Preserve me, O Elohim: for in thee do I put my trust.<br>2 O my soul, thou hast said unto Yahweh, Thou art my Yahweh: my goodness extendeth not to thee;<br>3 But to the saints that are in the earth, and to the excellent, in whom is all my delight.<br>4 Their sorrows shall be multiplied that hasten after another mighty one: their drink offerings of blood will I not offer, nor take up their names into my lips.<br>5 Yahweh is the portion of mine inheritance and of my cup: thou maintainest my lot.<br>6 The lines are fallen unto me in pleasant places; yea, I have a goodly heritage.<br>7 I will bless Yahweh, who hath given me counsel: my reins also instruct me in the night seasons.<br>8 I have set Yahweh always before me: because he is at my right hand, I shall not be moved.<br>9 Therefore my heart is glad, and my glory rejoiceth: my flesh also shall rest in hope.<br>10 For thou wilt not leave my soul in the grave; neither wilt thou suffer thine Holy One to see corruption.<br>11 Thou wilt shew me the path of life: in thy presence is fullness of joy; at thy right hand there are pleasures for evermore."
    },
    {
      "psalm": 21,
      "title": "Psalm 21 | \"The king shall joy in thy strength\"",
      "date": "Dec. 16th, 2025",
      "location": "Southeastern California",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-21-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/ZOjgH-Oowyk",
      "audioUrl": "/audio/Psalm-21.mp3",
      "length": "2:04",
      "description": "1 The king shall joy in thy strength, O Yahweh; and in thy salvation how greatly shall he rejoice!<br>2 Thou hast given him his heart's desire, and hast not withholden the request of his lips. Selah.<br>3 For thou preventest him with the blessings of goodness: thou settest a crown of pure gold on his head.<br>4 He asked life of thee, and thou gavest it him, even length of days for ever and ever.<br>5 His glory is great in thy salvation: honour and majesty hast thou laid upon him.<br>6 For thou hast made him most blessed for ever: thou hast made him exceeding glad with thy countenance.<br>7 For the king trusteth in Yahweh, and through the mercy of the most High he shall not be moved.<br>8 Thine hand shall find out all thine enemies: thy right hand shall find out those that hate thee.<br>9 Thou shalt make them as a fiery oven in the time of thine anger: Yahweh shall swallow them up in his wrath, and the fire shall devour them.<br>10 Their fruit shalt thou destroy from the earth, and their seed from among the children of men.<br>11 For they intended evil against thee: they imagined a mischievous device, which they are not able to perform.<br>12 Therefore shalt thou make them turn their back, when thou shalt make ready thine arrows upon thy strings against the face of them.<br>13 Be thou exalted, Yahweh, in thine own strength: so will we sing and praise thy power.<br>"
    },
    {
      "psalm": 22,
      "title": "Psalm 22 | \"My El, my El, why hast thou forsaken me?\"",
      "date": "Nov. 20th, 2025",
      "location": "Southwestern South Dakota",
      "time_of_day": "Sunrise",
      "image": "/images/thumbs/Psalms-22-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/RHuLftNXLvs",
      "audioUrl": "/audio/Psalm-22.mp3",
      "length": "4:51",
      "description": "1 My El, my El, why hast thou forsaken me? why art thou so far from helping me, and from the words of my roaring?<br>2 O my Elohim, I cry in the day time, but thou hearest not; and in the night season, and am not silent.<br>3 But thou art holy, O thou that inhabitest the praises of Israel.<br>4 Our fathers trusted in thee: they trusted, and thou didst deliver them.<br>5 They cried unto thee, and were delivered: they trusted in thee, and were not confounded.<br>6 But I am a worm, and no man; a reproach of men, and despised of the people.<br>7 All they that see me laugh me to scorn: they shoot out the lip, they shake the head, saying,<br>8 He trusted on Yahweh that he would deliver him: let him deliver him, seeing he delighted in him.<br>9 But thou art he that took me out of the womb: thou didst make me hope when I was upon my mother's breasts.<br>10 I was cast upon thee from the womb: thou art my Elohim from my mother's belly.<br>11 Be not far from me; for trouble is near; for there is none to help.<br>12 Many bulls have compassed me: strong bulls of Bashan have beset me round.<br>13 They gaped upon me with their mouths, as a ravening and a roaring lion.<br>14 I am poured out like water, and all my bones are out of joint: my heart is like wax; it is melted in the midst of my bowels.<br>15 My strength is dried up like a potsherd; and my tongue cleaveth to my jaws; and thou hast brought me into the dust of death.<br>16 For dogs have compassed me: the assembly of the wicked have inclosed me: they pierced my hands and my feet.<br>17 I may tell all my bones: they look and stare upon me.<br>18 They part my garments among them, and cast lots upon my vesture.<br>19 But be not thou far from me, O Yahweh: O my strength, haste thee to help me.<br>20 Deliver my soul from the sword; my darling from the power of the dog.<br>21 Save me from the lion's mouth: for thou hast heard me from the horns of the unicorns.<br>22 I will declare thy name unto my brethren: in the midst of the congregation will I praise thee.<br>23 Ye that fear Yahweh, praise him; all ye the seed of Jacob, glorify him; and fear him, all ye the seed of Israel.<br>24 For he hath not despised nor abhorred the affliction of the afflicted; neither hath he hid his face from him; but when he cried unto him, he heard.<br>25 My praise shall be of thee in the great congregation: I will pay my vows before them that fear him.<br>26 The meek shall eat and be satisfied: they shall praise Yahweh that seek him: your heart shall live for ever.<br>27 All the ends of the world shall remember and turn unto Yahweh: and all the kindreds of the nations shall worship before thee.<br>28 For the kingdom is Yahweh's: and he is the governor among the nations.<br>29 All they that be fat upon earth shall eat and worship: all they that go down to the dust shall bow before him: and none can keep alive his own soul.<br>30 A seed shall serve him; it shall be accounted to Yahweh for a generation.<br>31 They shall come, and shall declare his righteousness unto a people that shall be born, that he hath done this."
    },
    {
      "psalm": 25,
      "title": "Psalm 25 | \"Yea, let none that wait on thee be ashamed\"",
      "date": "Dec. 23rd, 2023",
      "location": "Northern Oregon",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-25-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/4u3c0l5gyJI",
      "audioUrl": "/audio/Psalm-25.mp3",
      "length": "2:54",
      "description": "<br>1 Unto thee, O Yahweh, do I lift up my soul.<br>2 O my Elohim, I trust in thee: let me not be ashamed, let not mine enemies triumph over me.<br>3 Yea, let none that wait on thee be ashamed: let them be ashamed which transgress without cause.<br>4 Shew me thy ways, O Yahweh; teach me thy paths.<br>5 Lead me in thy truth, and teach me: for thou art the Elohim of my salvation; on thee do I wait all the day.<br>6 Remember, O Yahweh, thy tender mercies and thy lovingkindnesses; for they have been ever of old.<br>7 Remember not the sins of my youth, nor my transgressions: according to thy mercy remember thou me for thy goodness' sake, O Yahweh.<br>8 Good and upright is Yahweh: therefore will he teach sinners in the way.<br>9 The meek will he guide in judgment: and the meek will he teach his way.<br>10 All the paths of Yahweh are mercy and truth unto such as keep his covenant and his testimonies.<br>11 For thy name's sake, O Yahweh, pardon mine iniquity; for it is great.<br>12 What man is he that feareth Yahweh? him shall he teach in the way that he shall choose.<br>13 His soul shall dwell at ease; and his seed shall inherit the earth.<br>14 The secret of Yahweh is with them that fear him; and he will shew them his covenant.<br>15 Mine eyes are ever toward Yahweh; for he shall pluck my feet out of the net.<br>16 Turn thee unto me, and have mercy upon me; for I am desolate and afflicted.<br>17 The troubles of my heart are enlarged: O bring thou me out of my distresses.<br>18 Look upon mine affliction and my pain; and forgive all my sins.<br>19 Consider mine enemies; for they are many; and they hate me with cruel hatred.<br>20 O keep my soul, and deliver me: let me not be ashamed; for I put my trust in thee.<br>21 Let integrity and uprightness preserve me; for I wait on thee.<br>22 Redeem Israel, O Elohim, out of all his troubles.<br>"
    },
    {
      "psalm": 26,
      "title": "Psalm 26 | \"Examine me, O Yahweh, and try me\"",
      "date": "Dec. 3rd, 2023",
      "location": "Central Minnesota",
      "time_of_day": "Sunset",
      "image": "/images/thumbs/Psalms-26-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/EeaPLLWrnDQ",
      "audioUrl": "/audio/Psalm-26.mp3",
      "length": "2:37",
      "description": "This Psalm reading was filmed just before sunset in the countryside of Minnesota.<br><br>1 Judge me, O Yahweh; for I have walked in mine integrity: I have trusted also in Yahweh; therefore I shall not slide.<br>2 Examine me, O Yahweh, and prove me; try my reins and my heart.<br>3 For thy lovingkindness is before mine eyes: and I have walked in thy truth.<br>4 I have not sat with vain persons, neither will I go in with dissemblers.<br>5 I have hated the congregation of evil doers; and will not sit with the wicked.<br>6 I will wash mine hands in innocency: so will I compass thine altar, O Yahweh:<br>7 That I may publish with the voice of thanksgiving, and tell of all thy wondrous works.<br>8 Yahweh, I have loved the habitation of thy house, and the place where thine honour dwelleth.<br>9 Gather not my soul with sinners, nor my life with bloody men:<br>10 In whose hands is mischief, and their right hand is full of bribes.<br>11 But as for me, I will walk in mine integrity: redeem me, and be merciful unto me.<br>12 My foot standeth in an even place: in the congregations will I bless Yahweh."
    },
    {
      "psalm": 28,
      "title": "Psalm 28 | \"Unto thee will I cry, O Yahweh my rock\"",
      "date": "Nov. 26th, 2025",
      "location": "Northeastern Utah",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-28-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/xUQ8LP9JBW4",
      "audioUrl": "/audio/Psalm-28.mp3",
      "length": "1:24",
      "description": "1 Unto thee will I cry, O Yahweh my rock; be not silent to me: lest, if thou be silent to me, I become like them that go down into the pit.<br>2 Hear the voice of my supplications, when I cry unto thee, when I lift up my hands toward thy holy oracle.<br>3 Draw me not away with the wicked, and with the workers of iniquity, which speak peace to their neighbours, but mischief is in their hearts.<br>4 Give them according to their deeds, and according to the wickedness of their endeavours: give them after the work of their hands; render to them their desert.<br>5 Because they regard not the works of Yahweh, nor the operation of his hands, he shall destroy them, and not build them up.<br>6 Blessed be Yahweh, because he hath heard the voice of my supplications.<br>7 Yahweh is my strength and my shield; my heart trusted in him, and I am helped: therefore my heart greatly rejoiceth; and with my song will I praise him.<br>8 Yahweh is their strength, and he iield; my heart trusted in him, and I am helped: therefore my heart greatly rejoiceth; and with my song will I praise him.<br>8 Yahweh is their strength, and he is the saving strength of his anointed.<br>9 Save thy people, and bless thine inheritance: feed them also, and lift them up for ever."
    },
    {
      "psalm": 30,
      "title": "Psalm 30 | \"Joy comes in the morning\"",
      "date": "Apr. 14, 2024",
      "location": "Central Minnesota",
      "time_of_day": "Sunrise",
      "image": "/images/thumbs/Psalms-30-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/0JGhEXjqV0c",
      "audioUrl": "/audio/Psalm-30.mp3",
      "length": "2:21",
      "description": "It is beginning to really show signs of Spring here and we are excited to have the opportunity to film these readings through the change of seasons.<br><br>We pray you are blessed and encouraged by this reading from Psalms 30, a thanksgiving Psalm of David for the Dedication of a House.<br><br>1 I will extol Thee, O Yahweh; for Thou hast lifted me up, and hast not made my foes to rejoice over me.<br>2 O Yahweh my Elohim, I cried unto Thee, and Thou hast healed me.<br>3 O Yahweh, Thou hast brought up my soul from the grave: Thou hast kept me alive, that I should not go down to the pit.<br>4 Sing unto Yahweh, O ye saints of His, and give thanks at the remembrance of His holiness.<br>5 For His anger endureth but a moment; in His favour is life: weeping may endure for a night, but joy cometh in the morning.<br>6 And in my prosperity I said, I shall never be moved.<br>7 Yahweh, by thy favour thou hast made my mountain to stand strong: Thou didst hide Thy face, and I was troubled.<br>8 I cried to thee, O Yahweh; and unto Yahweh I made supplication.<br>9 What profit is there in my blood, when I go down to the pit? Shall the dust praise Thee? shall it declare Thy truth?<br>10 Hear, O Yahweh, and have mercy upon me: Yahweh, be Thou my helper.<br>11 Thou hast turned for me my mourning into dancing: Thou hast put off my sackcloth, and girded me with gladness;<br>12 To the end that my glory may sing praise to Thee, and not be silent. O Yahweh my Elohim, I will give thanks unto Thee for ever."
    },
    {
      "psalm": 34,
      "title": "Psalm 34 | \"I will bless Yahweh at all times\"",
      "date": "Dec. 28th, 2025",
      "location": "Southern Missouri",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-34-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/6-B3FRUvsqo",
      "audioUrl": "/audio/Psalm-34.mp3",
      "length": "2:36",
      "description": "<br>1 I will bless Yahweh at all times: his praise shall continually be in my mouth.<br>2 My soul shall make her boast in Yahweh: the humble shall hear thereof, and be glad.<br>3 O magnify Yahweh with me, and let us exalt his name together.<br>4 I sought Yahweh, and he heard me, and delivered me from all my fears.<br>5 They looked unto him, and were lightened: and their faces were not ashamed.<br>6 This poor man cried, and Yahweh heard him, and saved him out of all his troubles.<br>7 The angel of Yahweh encampeth round about them that fear him, and delivereth them.<br>8 O taste and see that Yahweh is good: blessed is the man that trusteth in him.<br>9 O fear Yahweh, ye his saints: for there is no want to them that fear him.<br>10 The young lions do lack, and suffer hunger: but they that seek Yahweh shall not want any good thing.<br>11 Come, ye children, hearken unto me: I will teach you the fear of Yahweh.<br>12 What man is he that desireth life, and loveth many days, that he may see good?<br>13 Keep thy tongue from evil, and thy lips from speaking guile.<br>14 Depart from evil, and do good; seek peace, and pursue it.<br>15 The eyes of Yahweh are upon the righteous, and his ears are open unto their cry.<br>16 The face of Yahweh is against them that do evil, to cut off the remembrance of them from the earth.<br>17 The righteous cry, and Yahweh heareth, and delivereth them out of all their troubles.<br>18 Yahweh is nigh unto them that are of a broken heart; and saveth such as be of a contrite spirit.<br>19 Many are the afflictions of the righteous: but Yahweh delivereth him out of them all.<br>20 He keepeth all his bones: not one of them is broken.<br>21 Evil shall slay the wicked: and they that hate the righteous shall be desolate.<br>22 Yahweh redeemeth the soul of his servants: and none of them that trust in him shall be desolate."
    },
    {
      "psalm": 35,
      "title": "Psalm 35 | A psalm prophetic of the Messiah",
      "date": "May 5, 2024",
      "location": "Central Minnesota",
      "time_of_day": "Evening",
      "image": "/images/thumbs/Psalms-35-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/r9rH5Is4TBQ",
      "audioUrl": "/audio/Psalm-35.mp3",
      "length": "4:55",
      "description": "Psalm 35, no doubt, brings to mind the picture of Saul relentlessly chasing David to kill him. However, we shouldn't miss the vivid picture that it paints of Yahushua the Messiah.<br><br>This Psalm is actually a prophetic Psalm, quoted by Yahushua in John 15:25:<br><br><i>20 Remember the word that I said unto you, The servant is not greater than his master. If they have persecuted me, they will also persecute you;  if they have kept my saying, they will keep yours also.<br>21 But all these things will they do unto you for my name's sake, because they know not him that sent me.<br>22 If I had not come and spoken unto them, they had not had sin: but now they have no cloak for their sin.<br>23 He that hateth me hateth my Father also.<br>24 If I had not done among them the works which none other man did, they had not had sin: but now have they both seen and hated both me and my Father.<br>25 But this cometh to pass, that the word might be fulfilled that is written in their law, They hated me without a cause.</i><br><br>If we look at the rest of the Psalm we see many other parallels.<br><br><i>\"False witnesses did rise up; they laid to my charge things that I knew not\"</i> and <i>\"They rewarded me evil for good\"</i> are just a few examples.<br><br>So let us \"shout for joy, and be glad\" and say \"Let Yahweh be magnified!\" for what He did for us.<br><br>1 Plead my cause, O Yahweh, with them that strive with me: fight against them that fight against me.<br>2 Take hold of shield and buckler, and stand up for mine help.<br>3 Draw out also the spear, and stop the way against them that persecute me: say unto my soul, I am thy salvation.<br>4 Let them be confounded and put to shame that seek after my soul: let them be turned back and brought to confusion that devise my hurt.<br>5 Let them be as chaff before the wind: and let the angel of Yahweh chase them.<br>6 Let their way be dark and slippery: and let the angel of Yahweh persecute them.<br>7 For without cause have they hid for me their net in a pit, which without cause they have digged for my soul.<br>8 Let destruction come upon him at unawares; and let his net that he hath hid catch himself: into that very destruction let him fall.<br>9 And my soul shall be joyful in Yahweh: it shall rejoice in His salvation.<br>10 All my bones shall say, Yahweh, who is like unto thee, which deliverest the poor from him that is too strong for him, yea, the poor and the needy from him that spoileth him?<br>11 False witnesses did rise up; they laid to my charge things that I knew not.<br>12 They rewarded me evil for good to the spoiling of my soul.<br>13 But as for me, when they were sick, my clothing was sackcloth: I humbled my soul with fasting; and my prayer returned into mine own bosom.<br>14 I behaved myself as though he had been my friend or brother: I bowed down heavily, as one that mourneth for his mother.<br>15 But in mine adversity they rejoiced, and gathered themselves together: yea, the abjects gathered themselves together against me, and I knew it not; they did tear me, and ceased not:<br>16 With hypocritical mockers in feasts, they gnashed upon me with their teeth.<br>17 Yahweh, how long wilt Thou look on? rescue my soul from their destructions, my darling from the lions.<br>18 I will give Thee thanks in the great congregation: I will praise Thee among much people.<br>19 Let not them that are mine enemies wrongfully rejoice over me: neither let them wink with the eye that hate me without a cause.<br>20 For they speak not peace: but they devise deceitful matters against them that are quiet in the land.<br>21 Yea, they opened their mouth wide against me, and said, Aha, aha, our eye hath seen it.<br>22 This thou hast seen, O Yahweh: keep not silence: O Yahweh, be not far from me.<br>23 Stir up Thyself, and awake to my judgment, even unto my cause, my Elohim and my Sovereign.<br>24 Judge me, O Yahweh my Elohim, according to Thy righteousness; and let them not rejoice over me.<br>25 Let them not say in their hearts, Ah, so would we have it: let them not say, We have swallowed him up.<br>26 Let them be ashamed and brought to confusion together that rejoice at mine hurt: let them be clothed with shame and dishonour that magnify themselves against me.<br>27 Let them shout for joy, and be glad, that favour my righteous cause: yea, let them say continually, Let Yahweh be magnified, which hath pleasure in the prosperity of His servant.<br>28 And my tongue shall speak of Thy righteousness and of Thy praise all the day long."
    },
    {
      "psalm": 38,
      "title": "Psalm 38 | A psalm of David to bring to remembrance",
      "date": "Oct. 16, 2025",
      "location": "Southwestern South Dakota",
      "time_of_day": "Morning sunrise",
      "image": "/images/thumbs/Psalms-38-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/kuxQtXyYmyE",
      "audioUrl": "/audio/Psalm-38.mp3",
      "length": "2:55",
      "description": "1 O Yahweh, rebuke me not in thy wrath: neither chasten me in thy hot displeasure.<br>2 For thine arrows stick fast in me, and thy hand presseth me sore.<br>3 There is no soundness in my flesh because of thine anger; neither is there any rest in my bones because of my sin.<br>4 For mine iniquities are gone over mine head: as an heavy burden they are too heavy for me.<br>5 My wounds stink and are corrupt because of my foolishness.<br>6 I am troubled; I am bowed down greatly; I go mourning all the day long.<br>7 For my loins are filled with a loathsome disease: and there is no soundness in my flesh.<br>8 I am feeble and sore broken: I have roared by reason of the disquietness of my heart.<br>9 Yahweh, all my desire is before thee; and my groaning is not hid from thee.<br>10 My heart panteth, my strength faileth me: as for the light of mine eyes, it also is gone from me.<br>11 My lovers and my friends stand aloof from my sore; and my kinsmen stand afar off.<br>12 They also that seek after my life lay snares for me: and they that seek my hurt speak mischievous things, and imagine deceits all the day long.<br>13 But I, as a deaf man, heard not; and I was as a dumb man that openeth not his mouth.<br>14 Thus I was as a man that heareth not, and in whose mouth are no reproofs.<br>15 For in thee, O Yahweh, do I hope: thou wilt hear, O Yahweh my Elohim.<br>16 For I said, Hear me, lest otherwise they should rejoice over me: when my foot slippeth, they magnify themselves against me.<br>17 For I am ready to halt, and my sorrow is continually before me.<br>18 For I will declare mine iniquity; I will be sorry for my sin.<br>19 But mine enemies are lively, and they are strong: and they that hate me wrongfully are multiplied.<br>20 They also that render evil for good are mine adversaries; because I follow the thing that good is.<br>21 Forsake me not, O Yahweh: O my Elohim, be not far from me.<br>22 Make haste to help me, O Yahweh my salvation.<br>"
    },
    {
      "psalm": 42,
      "title": "Psalm 42 | \"As the hart panteth after the water brooks\"",
      "date": "Oct. 29th, 2024",
      "location": "Southern Missouri",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-42-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/agAeqIY6hXc",
      "audioUrl": "/audio/Psalm-42.mp3",
      "length": "2:48",
      "description": "We pray you are blessed and encouraged by this reading from Psalms 42, a Psalm of the Sons of Korah.<br><br>1 As the hart panteth after the water brooks, so panteth my soul after Thee, O Elohim.<br>2 My soul thirsteth for Elohim, for the living El: when shall I come and appear before Elohim?<br>3 My tears have been my meat day and night, while they continually say unto me, Where is thy Elohim?<br>4 When I remember these things, I pour out my soul in me: for I had gone with the multitude, I went with them to the house of Elohim, with the voice of joy and praise, with a multitude that kept holyday.<br>5 Why art thou cast down, O my soul? and why art thou disquieted in me? hope thou in Elohim: for I shall yet praise Him for the help of His countenance.<br>6 O my Elohim, my soul is cast down within me: therefore will I remember Thee from the land of Jordan, and of the Hermonites, from the hill Mizar.<br>7 Deep calleth unto deep at the noise of thy waterspouts: all Thy waves and Thy billows are gone over me.<br>8 Yet Yahweh will command His lovingkindness in the day time, and in the night His song shall be with me, and my prayer unto the El of my life.<br>9 I will say unto El my rock, Why hast Thou forgotten me? why go I mourning because of the oppression of the enemy?<br>10 As with a sword in my bones, mine enemies reproach me; while they say daily unto me, Where is thy Elohim?<br>11 Why art thou cast down, O my soul? and why art thou disquieted within me? hope thou in Elohim: for I shall yet praise Him, who is the health of my countenance, and my Elohim."
    },
    {
      "psalm": 43,
      "title": "Psalm 43 | \"Plead my cause against an unrighteous nation\"",
      "date": "Jan. 5th, 2026",
      "location": "Southwestern South Dakota",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-43-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/wG4TJvMwXS8",
      "audioUrl": "/audio/Psalm-43.mp3",
      "length": "1:06",
      "description": "1 Judge me, O Elohim, and plead my cause against an unrighteous nation: O deliver me from the deceitful and unjust man.<br>2 For thou art the Elohim of my strength: why dost thou cast me off? why go I mourning because of the oppression of the enemy?<br>3 O send out thy light and thy truth: let them lead me; let them bring me unto thy holy hill, and to thy tabernacles.<br>4 Then will I go unto the altar of Elohim, unto El my exceeding joy: yea, upon the harp will I praise thee, O Elohim my Elohim.<br>5 Why art thou cast down, O my soul? and why art thou disquieted within me? hope in Yahweh: for I shall yet praise him, who is the health of my countenance, and my Elohim."
    },
    {
      "psalm": 45,
      "title": "Psalm 45 | A wedding song",
      "date": "Jan. 14th, 2026",
      "location": "Oregon Coast",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-45-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/GMzeQ5-_SGM",
      "audioUrl": "/audio/Psalm-45.mp3",
      "length": "2:46",
      "description": "<br>1 My heart is inditing a good matter: I speak of the things which I have made touching the king: my tongue is the pen of a ready writer.<br>2 Thou art fairer than the children of men: grace is poured into thy lips: therefore Elohim hath blessed thee for ever.<br>3 Gird thy sword upon thy thigh, O most mighty, with thy glory and thy majesty.<br>4 And in thy majesty ride prosperously because of truth and meekness and righteousness; and thy right hand shall teach thee terrible things.<br>5 Thine arrows are sharp in the heart of the king's enemies; whereby the people fall under thee.<br>6 Thy throne, O Elohim, is for ever and ever: the sceptre of thy kingdom is a right sceptre.<br>7 Thou lovest righteousness, and hatest wickedness: therefore Elohim, thy Elohim, hath anointed thee with the oil of gladness above thy fellows.<br>8 All thy garments smell of myrrh, and aloes, and cassia, out of the ivory palaces, whereby they have made thee glad.<br>9 Kings' daughters were among thy honourable women: upon thy right hand did stand the queen in gold of Ophir.<br>10 Hearken, O daughter, and consider, and incline thine ear; forget also thine own people, and thy father's house;<br>11 So shall the king greatly desire thy beauty: for he is thy sovereign; and worship thou him.<br>12 And the daughter of Tyre shall be there with a gift; even the rich among the people shall intreat thy favour.<br>13 The king's daughter is all glorious within: her clothing is of wrought gold.<br>14 She shall be brought unto the king in raiment of needlework: the virgins her companions that follow her shall be brought unto thee.<br>15 With gladness and rejoicing shall they be brought: they shall enter into the king's palace.<br>16 Instead of thy fathers shall be thy children, whom thou mayest make princes in all the earth.<br>17 I will make thy name to be remembered in all generations: therefore shall the people praise thee for ever and ever.<br>"
    },
    {
      "psalm": 47,
      "title": "Psalm 47 | \"O clap your hands, all ye people\"",
      "date": "May 4th, 2026",
      "location": "Central Minnesota",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-47-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/IhfAlAq9DaA",
      "audioUrl": "/audio/Psalm-47.mp3",
      "length": "1:21",
      "description": "1 O clap your hands, all ye people; shout unto Elohim with the voice of triumph.<br>2 For Yahweh most high is terrible; he is a great King over all the earth.<br>3 He shall subdue the people under us, and the nations under our feet.<br>4 He shall choose our inheritance for us, the excellency of Jacob whom he loved. Selah.<br>5 Elohim is gone up with a shout, Yahweh with the sound of a trumpet.<br>6 Sing praises to Elohim, sing praises: sing praises unto our King, sing praises.<br>7 For Elohim is the King of all the earth: sing ye praises with understanding.<br>8 Elohim reigneth over the heathen: Elohim sitteth upon the throne of his holiness.<br>9 The princes of the people are gathered together, even the people of the Elohim of Abraham: for the shields of the earth belong unto Elohim: he is greatly exalted."
    },
    {
      "psalm": 49,
      "title": "Psalm 49 | Righteousness will be triumphant in the end",
      "date": "Mar. 18th, 2024",
      "location": "Central Minnesota",
      "time_of_day": "Sunset",
      "image": "/images/thumbs/Psalms-49-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/2CAnagRu7wo",
      "audioUrl": "/audio/Psalm-49.mp3",
      "length": "3:37",
      "description": "For the director of music. Of the Sons of Korah. A psalm.<br><br>1 Hear this, all ye people; give ear, all ye inhabitants of the world:<br>2 Both low and high, rich and poor, together.<br>3 My mouth shall speak of wisdom; and the meditation of my heart shall be of understanding.<br>4 I will incline mine ear to a parable: I will open my dark saying upon the harp.<br>5 Wherefore should I fear in the days of evil, when the iniquity of my heels shall compass me about?<br>6 They that trust in their wealth, and boast themselves in the multitude of their riches;<br>7 None of them can by any means redeem his brother, nor give to Elohim a ransom for him:<br>8 (For the redemption of their soul is precious, and it ceaseth for ever:)<br>9 That he should still live for ever, and not see corruption.<br>10 For he seeth that wise men die, likewise the fool and the brutish person perish, and leave their wealth to others.<br>11 Their inward thought is, that their houses shall continue for ever, and their dwelling places to all generations; they call their lands after their own names.<br>12 Nevertheless man being in honour abideth not: he is like the beasts that perish.<br>13 This their way is their folly: yet their posterity approve their sayings. Selah.<br>14 Like sheep they are laid in the grave; death shall feed on them; and the upright shall have dominion over them in the morning; and their beauty shall consume in the grave from their dwelling.<br>15 But Elohim will redeem my soul from the power of the grave: for he shall receive me. Selah.<br>16 Be not thou afraid when one is made rich, when the glory of his house is increased;<br>17 For when he dieth he shall carry nothing away: his glory shall not descend after him.<br>18 Though while he lived he blessed his soul: and men will praise thee, when thou doest well to thyself.<br>19 He shall go to the generation of his fathers; they shall never see light.<br>20 Man that is in honour, and understandeth not, is like the beasts that perish."
    },
    {
      "psalm": 52,
      "title": "Psalm 52 | \"I trust in the mercy of Elohim for ever\"",
      "date": "Jan. 30th, 2026",
      "location": "Southwestern South Dakota",
      "time_of_day": "Noon",
      "image": "/images/thumbs/Psalms-52-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/3Ly_35H1EdA",
      "audioUrl": "/audio/Psalm-52.mp3",
      "length": "1:24",
      "description": "<br>1 Why boastest thou thyself in mischief, O mighty man? the goodness of Elohim endureth continually.<br>2 The tongue deviseth mischiefs; like a sharp razor, working deceitfully.<br>3 Thou lovest evil more than good; and lying rather than to speak righteousness. Selah.<br>4 Thou lovest all devouring words, O thou deceitful tongue.<br>5 El shall likewise destroy thee for ever, he shall take thee away, and pluck thee out of thy dwelling place, and root thee out of the land of the living. Selah.<br>6 The righteous also shall see, and fear, and shall laugh at him:<br>7 Lo, this is the man that made not Elohim his strength; but trusted in the abundance of his riches, and strengthened himself in his wickedness.<br>8 But I am like a green olive tree in the house of Elohim: I trust in the mercy of Elohim for ever and ever.<br>9 I will praise thee for ever, because thou hast done it: and I will wait on thy name; for it is good before thy saints.<br> "
    },
    {
      "psalm": 53,
      "title": "Psalm 53 | \"There is none that doeth good\"",
      "date": "Nov. 18th, 2024",
      "location": "Western North Carolina",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-53-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/rXsJIgWjEpI",
      "audioUrl": "/audio/Psalm-53.mp3",
      "length": "1:45",
      "description": "The opportunity to film this video on a beautiful, sunny autumn day in \"the Blue Ridge\" was a real blessing. The leaves were just past the peak colors and falling from the trees.<br><br>We pray you are encouraged by this reading from Psalms 53, a Psalm of David which reminds us that none of us are righteous on our own. It is only through Yahushua the Messiah \"the salvation of Israel\" that we can be, and are, made righteous before Yahweh. And that is something that we can certainly be glad and thankful for.<br><br>1 The fool hath said in his heart, There is no Elohim. Corrupt are they, and have done abominable iniquity: there is none that doeth good.<br>2 Elohim looked down from heaven upon the children of men, to see if there were any that did understand, that did seek Elohim.<br>3 Every one of them is gone back: they are altogether become filthy; there is none that doeth good, no, not one.<br>4 Have the workers of iniquity no knowledge? who eat up My people as they eat bread: they have not called upon Elohim.<br>5 There were they in great fear, where no fear was: for Elohim hath scattered the bones of him that encampeth against thee: thou hast put them to shame, because Elohim hath despised them.<br>6 Oh that the salvation of Israel were come out of Zion! When Elohim bringeth back the captivity of His people, Jacob shall rejoice, and Israel shall be glad."
    },
   {
      "psalm": 56,
      "title": "Psalm 56 | Trust in Yahweh despite attacks from enemies",
      "date": "Feb. 25th, 2026",
      "location": "Northeastern Utah",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-56-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/Ct9iSR2Mi8Q",
      "audioUrl": "/audio/Psalm-56.mp3",
      "length": "2:07",
      "description": "1 Be merciful unto me, O Elohim: for man would swallow me up; he fighting daily oppresseth me.<br>2 Mine enemies would daily swallow me up: for they be many that fight against me, O thou most High.<br>3 What time I am afraid, I will trust in thee.<br>4 In Elohim I will praise his word, in Elohim I have put my trust; I will not fear what flesh can do unto me.<br>5 Every day they wrest my words: all their thoughts are against me for evil.<br>6 They gather themselves together, they hide themselves, they mark my steps, when they wait for my soul.<br>7 Shall they escape by iniquity? in thine anger cast down the people, O Elohim.<br>8 Thou tellest my wanderings: put thou my tears into thy bottle: are they not in thy book?<br>9 When I cry unto thee, then shall mine enemies turn back: this I know; for Elohim is for me.<br>10 In Elohim will I praise his word: in Yahweh will I praise his word.<br>11 In Elohim have I put my trust: I will not be afraid what man can do unto me.<br>12 Thy vows are upon me, O Elohim: I will render praises unto thee.<br>13 For thou hast delivered my soul from death: wilt not thou deliver my feet from falling, that I may walk before Elohim in the light of the living?"
    },
   {
      "psalm": 57,
      "title": "Psalm 57 | \"My heart is fixed, O Elohim\"",
      "date": "Feb. 25th, 2026",
      "location": "Southern Idaho",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-57-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/AHKtZgEYEwo",
      "audioUrl": "/audio/Psalm-57.mp3",
      "length": "1:56",
      "description": "1 Be merciful unto me, O Elohim, be merciful unto me: for my soul trusteth in thee: yea, in the shadow of thy wings will I make my refuge, until these calamities be overpast.<br>2 I will cry unto Elohim most high; unto Elohim that performeth all things for me.<br>3 He shall send from heaven, and save me from the reproach of him that would swallow me up. Selah. Elohim shall send forth his mercy and his truth.<br>4 My soul is among lions: and I lie even among them that are set on fire, even the sons of men, whose teeth are spears and arrows, and their tongue a sharp sword.<br>5 Be thou exalted, O Elohim, above the heavens; let thy glory be above all the earth.<br>6 They have prepared a net for my steps; my soul is bowed down: they have digged a pit before me, into the midst whereof they are fallen themselves. Selah.<br>7 My heart is fixed, O Elohim, my heart is fixed: I will sing and give praise.<br>8 Awake up, my glory; awake, psaltery and harp: I myself will awake early.<br>9 I will praise thee, O Yahweh, among the people: I will sing unto thee among the nations.<br>10 For thy mercy is great unto the heavens, and thy truth unto the clouds.<br>11 Be thou exalted, O Elohim, above the heavens: let thy glory be above all the earth."
    },
    {
      "psalm": 62,
      "title": "Psalm 62 | \"He is my defense; I shall not be moved\"",
      "date": "Nov. 30th, 2025",
      "location": "Central Colorado",
      "time_of_day": "Evening",
      "image": "/images/thumbs/Psalms-62-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/66wRdNS6UqA",
      "audioUrl": "/audio/Psalm-62.mp3",
      "length": "1:56",
      "description": "1 Truly my soul waiteth upon Elohim: from him cometh my salvation.<br>2 He only is my rock and my salvation; he is my defence; I shall not be greatly moved.<br>3 How long will ye imagine mischief against a man? ye shall be slain all of you: as a bowing wall shall ye be, and as a tottering fence.<br>4 They only consult to cast him down from his excellency: they delight in lies: they bless with their mouth, but they curse inwardly. Selah.<br>5 My soul, wait thou only upon Elohim; for my expectation is from him.<br>6 He only is my rock and my salvation: he is my defence; I shall not be moved.<br>7 In Elohim is my salvation and my glory: the rock of my strength, and my refuge, is in Elohim.<br>8 Trust in him at all times; ye people, pour out your heart before him: Elohim is a refuge for us. Selah.<br>9 Surely men of low degree are vanity, and men of high degree are a lie: to be laid in the balance, they are altogether lighter than vanity.<br>10 Trust not in oppression, and become not vain in robbery: if riches increase, set not your heart upon them.<br>11 Elohim hath spoken once; twice have I heard this; that power belongeth unto Elohim.<br>12 Also unto thee, O Yahweh, belongeth mercy: for thou renderest to every man according to his work."
    },
    {
      "psalm": 67,
      "title": "Psalm 67 | Prayer for mercy, blessing, and light",
      "date": "July 23rd, 2024",
      "location": "Northern Missouri",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-67-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/iUTcs1VYjKw",
      "audioUrl": "/audio/Psalm-67.mp3",
      "length": "1:04",
      "description": "Psalm 67 is a prayer for Yahweh's mercy, blessing, and light. It has some similarities to the Aaronic blessing in Numbers 6:24-26, particularly verse 1. This Psalm is a song written to \"the choirmaster\" and meant to be played with stringed instruments. One wonders what melody was played for this song...<br><br>We pray you are blessed and encouraged by this reading from Psalms 67.<br><br>1 Yahweh be merciful unto us, and bless us; and cause His face to shine upon us; Selah.<br>2 That Thy way may be known upon earth, Thy saving health among all nations.<br>3 Let the people praise Thee, O Elohim; let all the people praise Thee.<br>4 O let the nations be glad and sing for joy: for Thou shalt judge the people righteously, and govern the nations upon earth. Selah.<br>5 Let the people praise Thee, O Elohim; let all the people praise thee.<br>6 Then shall the earth yield her increase; and Elohim, even our own Elohim, shall bless us.<br>7 Elohim shall bless us; and all the ends of the earth shall fear Him."
    },
    {
      "psalm": 68,
      "title": "Psalm 68 | Yahweh's power, glory, and grace",
      "date": "April 20th, 2026",
      "location": "Northern California",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-68-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/_dw0ssvkdu0",
      "audioUrl": "/audio/Psalm-68.mp3",
      "length": "6:30",
      "description": "<br>1 Let Elohim arise, let his enemies be scattered: let them also that hate him flee before him.<br>2 As smoke is driven away, so drive them away: as wax melteth before the fire, so let the wicked perish at the presence of Elohim.<br>3 But let the righteous be glad; let them rejoice before Elohim: yea, let them exceedingly rejoice.<br>4 Sing unto Elohim, sing praises to his name: extol him that rideth upon the heavens by his name Yah, and rejoice before him.<br>5 A father of the fatherless, and a judge of the widows, is Elohim in his holy habitation.<br>6 Elohim setteth the solitary in families: he bringeth out those which are bound with chains: but the rebellious dwell in a dry land.<br>7 O Elohim, when thou wentest forth before thy people, when thou didst march through the wilderness; Selah:<br>8 The earth shook, the heavens also dropped at the presence of Elohim: even Sinai itself was moved at the presence of Elohim, the Elohim of Israel.<br>9 Thou, O Elohim, didst send a plentiful rain, whereby thou didst confirm thine inheritance, when it was weary.<br>10 Thy congregation hath dwelt therein: thou, O Elohim, hast prepared of thy goodness for the poor.<br>11 Yahweh gave the word: great was the company of those that published it.<br>12 Kings of armies did flee apace: and she that tarried at home divided the spoil.<br>13 Though ye have lien among the pots, yet shall ye be as the wings of a dove covered with silver, and her feathers with yellow gold.<br>14 When the Almighty scattered kings in it, it was white as snow in Salmon.<br>15 The hill of Elohim is as the hill of Bashan; an high hill as the hill of Bashan.<br>16 Why leap ye, ye high hills? this is the hill which Elohim desireth to dwell in; yea, Yahweh will dwell in it for ever.<br>17 The chariots of Elohim are twenty thousand, even thousands of angels: Yahweh is among them, as in Sinai, in the holy place.<br>18 Thou hast ascended on high, thou hast led captivity captive: thou hast received gifts for men; yea, for the rebellious also, that Yahweh Elohim might dwell among them.<br>19 Blessed be Yahweh, who daily loadeth us with benefits, even the Elohim of our salvation. Selah.<br>20 He that is our Elohim is the Elohim of salvation; and unto Elohim Yahweh belong the issues from death.<br>21 But Elohim shall wound the head of his enemies, and the hairy scalp of such an one as goeth on still in his trespasses.<br>22 Yahweh said, I will bring again from Bashan, I will bring my people again from the depths of the sea:<br>23 That thy foot may be dipped in the blood of thine enemies, and the tongue of thy dogs in the same.<br>24 They have seen thy goings, O Elohim; even the goings of my Elohim, my King, in the sanctuary.<br>25 The singers went before, the players on instruments followed after; among them were the damsels playing with timbrels.<br>26 Bless ye Elohim in the congregations, even Yahweh, from the fountain of Israel.<br>27 There is little Benjamin with their ruler, the princes of Judah and their council, the princes of Zebulun, and the princes of Naphtali.<br>28 Thy Elohim hath commanded thy strength: strengthen, O Elohim, that which thou hast wrought for us.<br>29 Because of thy temple at Jerusalem shall kings bring presents unto thee.<br>30 Rebuke the company of spearmen, the multitude of the bulls, with the calves of the people, till every one submit himself with pieces of silver: scatter thou the people that delight in war.<br>31 Princes shall come out of Egypt; Ethiopia shall soon stretch out her hands unto Elohim.<br>32 Sing unto Elohim, ye kingdoms of the earth; O sing praises unto Yahweh; Selah:<br>33 To him that rideth upon the heavens of heavens, which were of old; lo, he doth send out his voice, and that a mighty voice.<br>34 Ascribe ye strength unto Elohim: his excellency is over Israel, and his strength is in the clouds.<br>35 O Elohim, thou art terrible out of thy holy places: the El of Israel is he that giveth strength and power unto his people. Blessed be Elohim.<br>"
    },
    {
      "psalm": 69,
      "title": "Psalm 69 | \"They hated me without a cause\"",
      "date": "Sep. 25th, 2024",
      "location": "Central Colorado",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-69-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/lWTX4nBnCZI",
      "audioUrl": "/audio/Psalm-69.mp3",
      "length": "5:18",
      "description": "Psalm 69 is quoted at least six times in the NT as fulfillment of prophecy, including verse 4 in John 15:25 <i>\"But this cometh to pass, that the word might be fulfilled that is written in their law, They hated me without a cause\".</i><br><br>We pray you are blessed and encouraged by this reading from Psalm 69, a Psalm of David.<br><br>1 Save me, O Elohim; for the waters are come in unto my soul.<br>2 I sink in deep mire, where there is no standing: I am come into deep waters, where the floods overflow me.<br>3 I am weary of my crying: my throat is dried: mine eyes fail while I wait for my Elohim.<br>4 They that hate me without a cause are more than the hairs of mine head: they that would destroy me, being mine enemies wrongfully, are mighty: then I restored that which I took not away.<br>5 O Elohim, Thou knowest my foolishness; and my sins are not hid from Thee.<br>6 Let not them that wait on Thee, O my Sovereign Yahweh of Hosts, be ashamed for my sake: let not those that seek Thee be confounded for my sake, O Elohim of Israel.<br>7 Because for Thy sake I have borne reproach; shame hath covered my face.<br>8 I am become a stranger unto my brethren, and an alien unto my mother's children.<br>9 For the zeal of Thine house hath eaten me up; and the reproaches of them that reproached Thee are fallen upon me.<br>10 When I wept, and chastened my soul with fasting, that was to my reproach.<br>11 I made sackcloth also my garment; and I became a proverb to them.<br>12 They that sit in the gate speak against me; and I was the song of the drunkards.<br>13 But as for me, my prayer is unto thee, O Yahweh, in an acceptable time: O Elohim, in the multitude of Thy mercy hear me, in the truth of Thy salvation.<br>14 Deliver me out of the mire, and let me not sink: let me be delivered from them that hate me, and out of the deep waters.<br>15 Let not the waterflood overflow me, neither let the deep swallow me up, <br>16 Hear me, O Yahweh; for Thy lovingkindness is good: turn unto me according to the multitude of Thy tender mercies.<br>17 And hide not Thy face from Thy servant; for I am in trouble: hear me speedily.<br>18 Draw nigh unto my soul, and redeem it: deliver me because of mine enemies.<br>19 Thou hast known my reproach, and my shame, and my dishonour: mine adversaries are all before Thee.<br>20 Reproach hath broken my heart; and I am full of heaviness: and I looked for some to take pity, but there was none; and for comforters, but I found none.<br>21 They gave me also gall for my meat; and in my thirst they gave me vinegar to drink.<br>22 Let their table become a snare before them: and that which should have been for their welfare, let it become a trap.<br>23 Let their eyes be darkened, that they see not; and make their loins continually to shake.<br>24 Pour out Thine indignation upon them, and let Thy wrathful anger take hold of them.<br>25 Let their habitation be desolate; and let none dwell in their tents.<br>26 For they persecute him whom Thou hast smitten; and they talk to the grief of those whom Thou hast wounded.<br>27 Add iniquity unto their iniquity: and let them not come into Thy righteousness.<br>28 Let them be blotted out of the book of the living, and not be written with the righteous.<br>29 But I am poor and sorrowful: let Thy salvation, O Elohim, set me up on high.<br>30 I will praise the name of Elohim with a song, and will magnify Him with thanksgiving.<br>31 This also shall please Yahweh better than an ox or bullock that hath horns and hoofs.<br>32 The humble shall see this, and be glad: and your heart shall live that seek Elohim.<br>33 For Yahweh heareth the poor, and despiseth not His prisoners.<br>34 Let the heaven and earth praise Him, the seas, and every thing that moveth therein.<br>35 For Elohim will save Zion, and will build the cities of Judah: that they may dwell there, and have it in possession.<br>36 The seed also of His servants shall inherit it: and they that love His name shall dwell therein."
    },
    {
      "psalm": 73,
      "title": "Psalm 73 | Prosperity of the wicked vs. suffering of the righteous",
      "date": "Mar. 20th, 2026",
      "location": "Southern Missouri",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-73-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/QASM1TtOcIQ",
      "audioUrl": "/audio/Psalm-73.mp3",
      "length": "3:28",
      "description": "<br>1 Truly Elohim is good to Israel, even to such as are of a clean heart.<br>2 But as for me, my feet were almost gone; my steps had well nigh slipped.<br>3 For I was envious at the foolish, when I saw the prosperity of the wicked.<br>4 For there are no bands in their death: but their strength is firm.<br>5 They are not in trouble as other men; neither are they plagued like other men.<br>6 Therefore pride compasseth them about as a chain; violence covereth them as a garment.<br>7 Their eyes stand out with fatness: they have more than heart could wish.<br>8 They are corrupt, and speak wickedly concerning oppression: they speak loftily.<br>9 They set their mouth against the heavens, and their tongue walketh through the earth.<br>10 Therefore his people return hither: and waters of a full cup are wrung out to them.<br>11 And they say, How doth El know? and is there knowledge in the most High?<br>12 Behold, these are the wicked, who prosper in the world; they increase in riches.<br>13 Verily I have cleansed my heart in vain, and washed my hands in innocency.<br>14 For all the day long have I been plagued, and chastened every morning.<br>15 If I say, I will speak thus; behold, I should offend against the generation of thy children.<br>16 When I thought to know this, it was too painful for me;<br>17 Until I went into the sanctuary of El; then understood I their end.<br>18 Surely thou didst set them in slippery places: thou castedst them down into destruction.<br>19 How are they brought into desolation, as in a moment! they are utterly consumed with terrors.<br>20 As a dream when one awaketh; so, O Yahweh, when thou awakest, thou shalt despise their image.<br>21 Thus my heart was grieved, and I was pricked in my reins.<br>22 So foolish was I, and ignorant: I was as a beast before thee.<br>23 Nevertheless I am continually with thee: thou hast holden me by my right hand.<br>24 Thou shalt guide me with thy counsel, and afterward receive me to glory.<br>25 Whom have I in heaven but thee? and there is none upon earth that I desire beside thee.<br>26 My flesh and my heart faileth: but Elohim is the strength of my heart, and my portion for ever.<br>27 For, lo, they that are far from thee shall perish: thou hast destroyed all them that go a whoring from thee.<br>28 But it is good for me to draw near to Elohim: I have put my trust my Sovereign Yahweh, that I may declare all thy works.<br>"
    },
    {
      "psalm": 78,
      "title": "Psalm 78 | \"Give ear, O my people\"",
      "date": "Nov. 27th, 2024",
      "location": "Western North Carolina",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-78-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/XFD0wBNCu_U",
      "audioUrl": "/audio/Psalm-78.mp3",
      "length": "10:01",
      "description": "We pray that this reading encourages you today as Asaph (the author of this Psalm) recounts Yahweh's \"wonderful works that He hath done\" for Israel, from the time they were in Egypt to the time of king David despite their stiff-necked rebellion.<br><br>1 Give ear, O my people, to my law: incline your ears to the words of my mouth.<br>2 I will open my mouth in a parable: I will utter dark sayings of old:<br>3 Which we have heard and known, and our fathers have told us.<br>4 We will not hide them from their children, shewing to the generation to come the praises of Yahweh, and His strength, and His wonderful works that He hath done.<br>5 For He established a testimony in Jacob, and appointed a law in Israel, which He commanded our fathers, that they should make them known to their children:<br>6 That the generation to come might know them, even the children which should be born; who should arise and declare them to their children:<br>7 That they might set their hope in Elohim, and not forget the works of Elohim, but keep His commandments:<br>8 And might not be as their fathers, a stubborn and rebellious generation; a generation that set not their heart aright, and whose spirit was not stedfast with El.<br>9 The children of Ephraim, being armed, and carrying bows, turned back in the day of battle.<br>10 They kept not the covenant of Elohim, and refused to walk in His law;<br>11 And forgat His works, and His wonders that He had shewed them.<br>12 Marvellous things did He in the sight of their fathers, in the land of Egypt, in the field of Zoan.<br>13 He divided the sea, and caused them to pass through; and He made the waters to stand as an heap.<br>14 In the daytime also He led them with a cloud, and all the night with a light of fire.<br>15 He clave the rocks in the wilderness, and gave them drink as out of the great depths.<br>16 He brought streams also out of the rock, and caused waters to run down like rivers.<br>17 And they sinned yet more against Him by provoking the most High in the wilderness.<br>18 And they tempted Elohim in their heart by asking meat for their lust.<br>19 Yea, they spake against Elohim; they said, Can Elohim furnish a table in the wilderness?<br>20 Behold, He smote the rock, that the waters gushed out, and the streams overflowed; can He give bread also? can He provide flesh for His people?<br>21 Therefore Yahweh heard this, and was wroth: so a fire was kindled against Jacob, and anger also came up against Israel;<br>22 Because they believed not in Elohim, and trusted not in His salvation:<br>23 Though He had commanded the clouds from above, and opened the doors of heaven,<br>24 And had rained down manna upon them to eat, and had given them of the corn of heaven.<br>25 Man did eat angels' food: He sent them meat to the full.<br>26 He caused an east wind to blow in the heaven: and by His power He brought in the south wind.<br>27 He rained flesh also upon them as dust, and feathered fowls like as the sand of the sea:<br>28 And He let it fall in the midst of their camp, round about their habitations.<br>29 So they did eat, and were well filled: for He gave them their own desire;<br>30 They were not estranged from their lust. But while their meat was yet in their mouths,<br>31 The wrath of Elohim came upon them, and slew the fattest of them, and smote down the chosen men of Israel.<br>32 For all this they sinned still, and believed not for His wondrous works.<br>33 Therefore their days did He consume in vanity, and their years in trouble.<br>34 When He slew them, then they sought Him: and they returned and enquired early after Elohim.<br>35 And they remembered that El was their rock, and the high El their redeemer.<br>36 Nevertheless they did flatter Him with their mouth, and they lied unto Him with their tongues.<br>37 For their heart was not right with Him, neither were they stedfast in His covenant.<br>38 But He, being full of compassion, forgave their iniquity, and destroyed them not: yea, many a time turned He his anger away, and did not stir up all His wrath.<br>39 For He remembered that they were but flesh; a wind that passeth away, and cometh not again.<br>40 How oft did they provoke Him in the wilderness, and grieve Him in the desert!<br>41 Yea, they turned back and tempted Elohim, and limited the Holy One of Israel.<br>42 They remembered not His hand, nor the day when He delivered them from the enemy.<br>43 How He had wrought His signs in Egypt, and His wonders in the field of Zoan.<br>44 And had turned their rivers into blood; and their floods, that they could not drink.<br>45 He sent divers sorts of flies among them, which devoured them; and frogs, which destroyed them.<br>46 He gave also their increase unto the caterpiller, and their labour unto the locust.<br>47 He destroyed their vines with hail, and their sycomore trees with frost.<br>48 He gave up their cattle also to the hail, and their flocks to hot thunderbolts.<br>49 He cast upon them the fierceness of His anger, wrath, and indignation, and trouble, by sending evil angels among them.<br>50 He made a way to His anger; He spared not their soul from death, but gave their life over to the pestilence;<br>51 And smote all the firstborn in Egypt; the chief of their strength in the tabernacles of Ham:<br>52 But made His own people to go forth like sheep, and guided them in the wilderness like a flock.<br>53 And He led them on safely, so that they feared not: but the sea overwhelmed their enemies.<br>54 And He brought them to the border of his sanctuary, even to this mountain, which His right hand had purchased.<br>55 He cast out the heathen also before them, and divided them an inheritance by line, and made the tribes of Israel to dwell in their tents.<br>56 Yet they tempted and provoked the most high Elohim, and kept not His testimonies:<br>57 But turned back, and dealt unfaithfully like their fathers: they were turned aside like a deceitful bow.<br>58 For they provoked Him to anger with their high places, and moved Him to jealousy with their graven images.<br>59 When Elohim heard this, He was wroth, and greatly abhorred Israel:<br>60 So that He forsook the tabernacle of Shiloh, the tent which He placed among men;<br>61 And delivered His strength into captivity, and His glory into the enemy's hand.<br>62 He gave His people over also unto the sword; and was wroth with His inheritance.<br>63 The fire consumed their young men; and their maidens were not given to marriage.<br>64 Their priests fell by the sword; and their widows made no lamentation.<br>65 Then Yahweh awaked as one out of sleep, and like a mighty man that shouteth by reason of wine.<br>66 And He smote His enemies in the hinder parts: He put them to a perpetual reproach.<br>67 Moreover He refused the tabernacle of Joseph, and chose not the tribe of Ephraim:<br>68 But chose the tribe of Judah, the mount Zion which He loved.<br>69 And He built His sanctuary like high palaces, like the earth which He hath established for ever.<br>70 He chose David also His servant, and took Him from the sheepfolds:<br>71 From following the ewes great with young He brought him to feed Jacob His people, and Israel His inheritance.<br>72 So He fed them according to the integrity of His heart; and guided them by the skilfulness of His hands."
    },
    {
      "psalm": 82,
      "title": "Psalm 82 | \"Arise, O Elohim\"",
      "date": "Jan. 18th, 2025",
      "location": "Oregon",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-82-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/XagtINWEHlc",
      "audioUrl": "/audio/Psalm-82.mp3",
      "length": "1:10",
      "description": "1 Elohim standeth in the congregation of the mighty; he judgeth among the mighty ones.<br>2 How long will ye judge unjustly, and accept the persons of the wicked? Selah.<br>3 Defend the poor and fatherless: do justice to the afflicted and needy.<br>4 Deliver the poor and needy: rid them out of the hand of the wicked.<br>5 They know not, neither will they understand; they walk on in darkness: all the foundations of the earth are out of course.<br>6 I have said, Ye are mighty ones; and all of you are children of the most High.<br>7 But ye shall die like men, and fall like one of the princes.<br>8 Arise, O Elohim, judge the earth: for thou shalt inherit all nations."
    },
    {
      "psalm": 83,
      "title": "Psalm 83 | A song or Psalm of Asaph",
      "date": "Jan. 13th, 2026",
      "location": "Southeastern California",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-83-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/zGpBDyqw-_Y",
      "audioUrl": "/audio/Psalm-83.mp3",
      "length": "2:19",
      "description": "<br>1 Keep not thou silence, O Elohim: hold not thy peace, and be not still, O El.<br>2 For, lo, thine enemies make a tumult: and they that hate thee have lifted up the head.<br>3 They have taken crafty counsel against thy people, and consulted against thy hidden ones.<br>4 They have said, Come, and let us cut them off from being a nation; that the name of Israel may be no more in remembrance.<br>5 For they have consulted together with one consent: they are confederate against thee:<br>6 The tabernacles of Edom, and the Ishmaelites; of Moab, and the Hagarenes;<br>7 Gebal, and Ammon, and Amalek; the Philistines with the inhabitants of Tyre;<br>8 Assur also is joined with them: they have holpen the children of Lot. Selah.<br>9 Do unto them as unto the Midianites; as to Sisera, as to Jabin, at the brook of Kison:<br>10 Which perished at Endor: they became as dung for the earth.<br>11 Make their nobles like Oreb, and like Zeeb: yea, all their princes as Zebah, and as Zalmunna:<br>12 Who said, Let us take to ourselves the houses of Elohim in possession.<br>13 O my Elohim, make them like a wheel; as the stubble before the wind.<br>14 As the fire burneth a wood, and as the flame setteth the mountains on fire;<br>15 So persecute them with thy tempest, and make them afraid with thy storm.<br>16 Fill their faces with shame; that they may seek thy name, O Yahweh.<br>17 Let them be confounded and troubled for ever; yea, let them be put to shame, and perish:<br>18 That men may know that thou, whose name alone is Yahweh, art the most high over all the earth.<br>"
    },
    {
      "psalm": 84,
      "title": "Psalm 84 | \"A day in Thy courts is better than a thousand\"",
      "date": "Sep. 17th, 2024",
      "location": "Central Colorado",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-84-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/Ma07qvpqWTg",
      "audioUrl": "/audio/Psalm-84.mp3",
      "length": "2:02",
      "description": "1 How amiable are Thy tabernacles, O Yahweh of hosts!<br>2 My soul longeth, yea, even fainteth for the courts of Yahweh: my heart and my flesh crieth out for the living El.<br>3 Yea, the sparrow hath found an house, and the swallow a nest for herself, where she may lay her young, even Thine altars, O Yahweh of hosts, my King, and my Elohim.<br>4 Blessed are they that dwell in Thy house: they will be still praising Thee. Selah.<br>5 Blessed is the man whose strength is in Thee; in whose heart are the ways of them.<br>6 Who passing through the valley of Baca make it a well; the rain also filleth the pools.<br>7 They go from strength to strength, every one of them in Zion appeareth before Elohim.<br>8 O Yahweh Elohim of hosts, hear my prayer: give ear, O Elohim of Jacob. Selah.<br>9 Behold, O Elohim our shield, and look upon the face of Thine anointed.<br>10 For a day in Thy courts is better than a thousand. I had rather be a doorkeeper in the house of my Elohim, than to dwell in the tents of wickedness.<br>11 For Yahweh Elohim is a sun and shield: Yahweh will give grace and glory: no good thing will He withhold from them that walk uprightly.<br>12 O Yahweh of hosts, blessed is the man that trusteth in Thee."
    },
    {
      "psalm": 87,
      "title": "Psalm 87 | Yahweh's love for Zion",
      "date": "Mar. 5th, 2026",
      "location": "Southwestern South Dakota",
      "time_of_day": "Evening",
      "image": "/images/thumbs/Psalms-87-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/XVH6zxByxy0",
      "audioUrl": "/audio/Psalm-87.mp3",
      "length": "0:55",
      "description": "1 His foundation is in the holy mountains.<br>2 Yahweh loveth the gates of Zion more than all the dwellings of Jacob.<br>3 Glorious things are spoken of thee, O city of Elohim. Selah.<br>4 I will make mention of Rahab and Babylon to them that know me: behold Philistia, and Tyre, with Ethiopia; this man was born there.<br>5 And of Zion it shall be said, This and that man was born in her: and the highest himself shall establish her.<br>6 Yahweh shall count, when he writeth up the people, that this man was born there. Selah.<br>7 As well the singers as the players on instruments shall be there: all my springs are in thee."
    },
    {
      "psalm": 90,
      "title": "Psalm 90 | \"A thousand years in Thy sight\"",
      "date": "Feb. 25th, 2024",
      "location": "Central Minnesota",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-90-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/ydr4qt-5emI",
      "audioUrl": "/audio/Psalm-90.mp3",
      "length": "3:06",
      "description": "1 Yahweh, thou hast been our dwelling place in all generations.<br>2 Before the mountains were brought forth, or ever thou hadst formed the earth and the world, even from everlasting to everlasting, thou art Elohim.<br>3 Thou turnest man to destruction; and sayest, Return, ye children of men.<br>4 For a thousand years in thy sight are but as yesterday when it is past, and as a watch in the night.<br>5 Thou carriest them away as with a flood; they are as a sleep: in the morning they are like grass which groweth up.<br>6 In the morning it flourisheth, and groweth up; in the evening it is cut down, and withereth.<br>7 For we are consumed by thine anger, and by thy wrath are we troubled.<br>8 Thou hast set our iniquities before thee, our secret sins in the light of thy countenance.<br>9 For all our days are passed away in thy wrath: we spend our years as a tale that is told.<br>10 The days of our years are threescore years and ten; and if by reason of strength they be fourscore years, yet is their strength labour and sorrow; for it is soon cut off, and we fly away.<br>11 Who knoweth the power of thine anger? even according to thy fear, so is thy wrath.<br>12 So teach us to number our days, that we may apply our hearts unto wisdom.<br>13 Return, O Yahweh, how long? and let it repent thee concerning thy servants.<br>14 O satisfy us early with thy mercy; that we may rejoice and be glad all our days.<br>15 Make us glad according to the days wherein thou hast afflicted us, and the years wherein we have seen evil.<br>16 Let thy work appear unto thy servants, and thy glory unto their children.<br>17 And let the beauty of Yahweh our Elohim be upon us: and establish thou the work of our hands upon us; yea, the work of our hands establish thou it."
    },
    {
      "psalm": 92,
      "title": "Psalm 92 | \"It is a good thing to give thanks unto the Yahweh\"",
      "date": "Feb. 4th, 2026",
      "location": "Oregon",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-92-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/6L8N4FL6Yks",
      "audioUrl": "/audio/Psalm-92.mp3",
      "length": "2:06",
      "description": "<br>1 It is a good thing to give thanks unto the Yahweh, and to sing praises unto thy name, O Most High:<br>2 To shew forth thy lovingkindness in the morning, and thy faithfulness every night,<br>3 Upon an instrument of ten strings, and upon the psaltery; upon the harp with a solemn sound.<br>4 For thou, Yahweh, hast made me glad through thy work: I will triumph in the works of thy hands.<br>5 O Yahweh, how great are thy works! and thy thoughts are very deep.<br>6 A brutish man knoweth not; neither doth a fool understand this.<br>7 When the wicked spring as the grass, and when all the workers of iniquity do flourish; it is that they shall be destroyed for ever:<br>8 But thou, Yahweh, art most high for evermore.<br>9 For, lo, thine enemies, O Yahweh, for, lo, thine enemies shall perish; all the workers of iniquity shall be scattered.<br>10 But my horn shalt thou exalt like the horn of an unicorn: I shall be anointed with fresh oil.<br>11 Mine eye also shall see my desire on mine enemies, and mine ears shall hear my desire of the wicked that rise up against me.<br>12 The righteous shall flourish like the palm tree: he shall grow like a cedar in Lebanon.<br>13 Those that be planted in the house of the Yahweh shall flourish in the courts of our Elohim.<br>14 They shall still bring forth fruit in old age; they shall be fat and flourishing;<br>15 To shew that the Yahweh is upright: he is my rock, and there is no unrighteousness in him.<br>"
    },
    {
      "psalm": 96,
      "title": "Psalm 96 | \"Sing unto Yahweh a new song\"",
      "date": "Mar. 10th, 2024",
      "location": "Central Minnesota",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-96-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/47MfEt7usM8",
      "audioUrl": "/audio/Psalm-96.mp3",
      "length": "2:19",
      "description": "We pray you are blessed and encouraged by this reading from Psalms 96, set in the midst of cedar trees.<br><br>1 O sing unto Yahweh a new song: sing unto Yahweh, all the earth.<br>2 Sing unto Yahweh, bless his name; shew forth His salvation from day to day.<br>3 Declare His glory among the heathen, His wonders among all people.<br>4 For Yahweh is great, and greatly to be praised: He is to be feared above all mighty ones.<br>5 For all the mighty ones of the nations are idols: but Yahweh made the heavens.<br>6 Honor and majesty are before Him: strength and beauty are in his sanctuary.<br>7 Give unto Yahweh, O ye kindreds of the people, give unto Yahweh glory and strength.<br>8 Give unto Yahweh the glory due unto His name: bring an offering, and come into His courts.<br>9 O worship Yahweh in the beauty of holiness: fear before Him, all the earth.<br>10 Say among the heathen that Yahweh reigneth: the world also shall be established that it shall not be moved: He shall judge the people righteously.<br>11 Let the heavens rejoice, and let the earth be glad; let the sea roar, and the fullness thereof.<br>12 Let the field be joyful, and all that is therein: then shall all the trees of the wood rejoice<br>13 Before Yahweh: for He cometh, for He cometh to judge the earth: He shall judge the world with righteousness, and the people with His truth."
    },
    {
      "psalm": 97,
      "title": "Psalm 97 | \"Yahweh is King\"",
      "date": "Dec. 29th, 2024",
      "location": "Central Minnesota",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-97-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/xor3juLhISg",
      "audioUrl": "/audio/Psalm-97.mp3",
      "length": "1:56",
      "description": "1 Yahweh reigneth; let the earth rejoice; let the multitude of isles be glad thereof.<br>2 Clouds and darkness are round about Him: righteousness and judgment are the habitation of His throne.<br>3 A fire goeth before Him, and burneth up His enemies round about.<br>4 His lightnings enlightened the world: the earth saw, and trembled.<br>5 The hills melted like wax at the presence of Yahweh, at the presence of Yahweh of the whole earth.<br>6 The heavens declare His righteousness, and all the people see His glory.<br>7 Confounded be all they that serve graven images, that boast themselves of idols: worship Him, all ye mighty ones.<br>8 Zion heard, and was glad; and the daughters of Judah rejoiced because of Thy judgments, O Yahweh.<br>9 For Thou, Yahweh, art high above all the earth: Thou art exalted far above all mighty ones.<br>10 Ye that love Yahweh, hate evil: He preserveth the souls of His saints; He delivereth them out of the hand of the wicked.<br>11 Light is sown for the righteous, and gladness for the upright in heart.<br>12 Rejoice in Yahweh, ye righteous; and give thanks at the remembrance of His holiness."
    },
    {
      "psalm": 99,
      "title": "Psalm 99 | A royal psalm to Yahweh our King",
      "date": "July 22nd, 2024",
      "location": "Northern Missouri",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-99-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/msVmrtIuu4E",
      "audioUrl": "/audio/Psalm-99.mp3",
      "length": "1:22",
      "description": "We pray you are blessed and encouraged by this reading from Psalms 99, a royal Psalm praising Yahweh as the King.<br><br>1 Yahweh reigneth; let the people tremble: He sitteth between the cherubims; let the earth be moved.<br>2 Yahweh is great in Zion; and He is high above all the people.<br>3 Let them praise Thy great and terrible name; for it is holy.<br>4 The king's strength also loveth judgment; Thou dost establish equity, Thou executest judgment and righteousness in Jacob.<br>5 Exalt ye Yahweh our Elohim, and worship at His footstool; for He is holy.<br>6 Moses and Aaron among His priests, and Samuel among them that call upon His name; they called upon Yahweh, and He answered them.<br>7 He spake unto them in the cloudy pillar: they kept His testimonies, and the ordinance that He gave them.<br>8 Thou answeredst them, O Yahweh our Elohim: Thou wast an El that forgavest them, though Thou tookest vengeance of their inventions.<br>9 Exalt Yahweh our Elohim, and worship at His holy hill; for Yahweh our Elohim is holy."
    },
    {
      "psalm": 104,
      "title": "Psalm 104 | I will sing unto Yahweh as long as I live",
      "date": "July 25th, 2025",
      "location": "Central Minnesota",
      "time_of_day": "Midday",
      "image": "/images/thumbs/Psalms-104-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/KoMecY_79mI",
      "audioUrl": "/audio/Psalm-104.mp3",
      "length": "5:06",
      "description": "1 Bless Yahweh, O my soul. O Yahweh my Elohim, thou art very great; thou art clothed with honour and majesty.<br>2 Who coverest thyself with light as with a garment: who stretchest out the heavens like a curtain:<br>3 Who layeth the beams of his chambers in the waters: who maketh the clouds his chariot: who walketh upon the wings of the wind:<br>4 Who maketh his angels spirits; his ministers a flaming fire:<br>5 Who laid the foundations of the earth, that it should not be removed for ever.<br>6 Thou coveredst it with the deep as with a garment: the waters stood above the mountains.<br>7 At thy rebuke they fled; at the voice of thy thunder they hasted away.<br>8 They go up by the mountains; they go down by the valleys unto the place which thou hast founded for them.<br>9 Thou hast set a bound that they may not pass over; that they turn not again to cover the earth.<br>10 He sendeth the springs into the valleys, which run among the hills.<br>11 They give drink to every beast of the field: the wild donkeys quench their thirst.<br>12 By them shall the fowls of the heaven have their habitation, which sing among the branches.<br>13   watereth the hills from his chambers: the earth is satisfied with the fruit of thy works.<br>14 He causeth the grass to grow for the cattle, and herb for the service of man: that he may bring forth food out of the earth;<br>15 And wine that maketh glad the heart of man, and oil to make his face to shine, and bread which strengtheneth man's heart.<br>16 The trees of Yahweh are full of sap; the cedars of Lebanon, which he hath planted;<br>17 Where the birds make their nests: as for the stork, the fir trees are her house.<br>18 The high hills are a refuge for the wild goats; and the rocks for the conies.<br>19 He appointed the moon for seasons: the sun knoweth his going down.<br>20 Thou makest darkness, and it is night: wherein all the beasts of the forest do creep forth.<br>21 The young lions roar after their prey, and seek their meat from El.<br>22 The sun ariseth, they gather themselves together, and lay them down in their dens.<br>23 Man goeth forth unto his work and to his labour until the evening.<br>24 O Yahweh, how manifold are thy works! in wisdom hast thou made them all: the earth is full of thy riches.<br>25 So is this great and wide sea, wherein are things creeping innumerable, both small and great beasts.<br>26 There go the ships: there is that leviathan, whom thou hast made to play therein.<br>27 These wait all upon thee; that thou mayest give them their meat in due season.<br>28 That thou givest them they gather: thou openest thine hand, they are filled with good.<br>29 Thou hidest thy face, they are troubled: thou takest away their breath, they die, and return to their dust.<br>30 Thou sendest forth thy spirit, they are created: and thou renewest the face of the earth.<br>31 The glory of Yahweh shall endure for ever: Yahweh shall rejoice in his works.<br>32 He looketh on the earth, and it trembleth: he toucheth the hills, and they smoke.<br>33 I will sing unto Yahweh as long as I live: I will sing praise to my Elohim while I have my being.<br>34 My meditation of him shall be sweet: I will be glad in Yahweh.<br>35 Let the sinners be consumed out of the earth, and let the wicked be no more. Bless thou Yahweh, O my soul. Praise ye Yahweh."
    },
    {
      "psalm": 105,  
      "title": "Psalm 105 | Thanksgiving to Yahweh for His faithfulness",
      "date": "Mar. 16th, 2025",
      "location": "Central Minnesota",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-105-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/k07IWhLJbLs",
      "audioUrl": "/audio/Psalm-105.mp3",
      "length": "5:50",
      "description": "1 O give thanks unto Yahweh; call upon His name: make known His deeds among the people.<br>2 Sing unto Him, sing psalms unto Him: talk ye of all His wondrous works.<br>3 Glory ye in His holy name: let the heart of them rejoice that seek Yahweh.<br>4 Seek Yahweh, and His strength: seek His face evermore.<br>5 Remember His marvellous works that He hath done; His wonders, and the judgments of His mouth;<br>6 O ye seed of Abraham His servant, ye children of Jacob His chosen.<br>7 He is Yahweh our Elohim: His judgments are in all the earth.<br>8 He hath remembered His covenant for ever, the word which He commanded to a thousand generations.<br>9 Which covenant He made with Abraham, and His oath unto Isaac;<br>10 And confirmed the same unto Jacob for a law, and to Israel for an everlasting covenant:<br>11 Saying, Unto thee will I give the land of Canaan, the lot of your inheritance:<br>12 When they were but a few men in number; yea, very few, and strangers in it.<br>13 When they went from one nation to another, from one kingdom to another people;<br>14 He suffered no man to do them wrong: yea, He reproved kings for their sakes;<br>15 Saying, Touch not mine anointed, and do my prophets no harm.<br>16 Moreover He called for a famine upon the land: He brake the whole staff of bread.<br>17 He sent a man before them, even Joseph, who was sold for a servant:<br>18 Whose feet they hurt with fetters: he was laid in iron:<br>19 Until the time that his word came: the word of Yahweh tried him.<br>20 The king sent and loosed him; even the ruler of the people, and let him go free.<br>21 He made him master of his house, and ruler of all his substance:<br>22 To bind his princes at his pleasure; and teach his senators wisdom.<br>23 Israel also came into Egypt; and Jacob sojourned in the land of Ham.<br>24 And He increased His people greatly; and made them stronger than their enemies.<br>25 He turned their heart to hate His people, to deal subtilly with his servants.<br>26 He sent Moses His servant; and Aaron whom He had chosen.<br>27 They shewed His signs among them, and wonders in the land of Ham.<br>28 He sent darkness, and made it dark; and they rebelled not against His word.<br>29 He turned their waters into blood, and slew their fish.<br>30 Their land brought forth frogs in abundance, in the chambers of their kings.<br>31 He spake, and there came divers sorts of flies, and lice in all their coasts.<br>32 He gave them hail for rain, and flaming fire in their land.<br>33 He smote their vines also and their fig trees; and brake the trees of their coasts.<br>34 He spake, and the locusts came, and caterpillers, and that without number,<br>35 And did eat up all the herbs in their land, and devoured the fruit of their ground.<br>36 He smote also all the firstborn in their land, the chief of all their strength.<br>37 He brought them forth also with silver and gold: and there was not one feeble person among their tribes.<br>38 Egypt was glad when they departed: for the fear of them fell upon them.<br>39 He spread a cloud for a covering; and fire to give light in the night.<br>40 The people asked, and He brought quails, and satisfied them with the bread of heaven.<br>41 He opened the rock, and the waters gushed out; they ran in the dry places like a river.<br>42 For He remembered His holy promise, and Abraham His servant.<br>43 And He brought forth His people with joy, and His chosen with gladness:<br>44 And gave them the lands of the heathen: and they inherited the labour of the people;<br>45 That they might observe His statutes, and keep His laws. Praise ye Yahweh."
    },
    {
      "psalm": 106,
      "title": "Psalm 106 | \"O give thanks unto Yahweh; for he is good\"",
      "date": "Dec. 5th, 2025",
      "location": "Northeastern Utah",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-106-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/hziBZHHIE6Y",
      "audioUrl": "/audio/Psalm-106.mp3",
      "length": "6:12",
      "description": "1 Praise ye Yahweh. O give thanks unto Yahweh; for he is good: for his mercy endureth for ever.<br>2 Who can utter the mighty acts of Yahweh? who can shew forth all his praise?<br>3 Blessed are they that keep judgment, and he that doeth righteousness at all times.<br>4 Remember me, O Yahweh, with the favour that thou bearest unto thy people: O visit me with thy salvation;<br>5 That I may see the good of thy chosen, that I may rejoice in the gladness of thy nation, that I may glory with thine inheritance.<br>6 We have sinned with our fathers, we have committed iniquity, we have done wickedly.<br>7 Our fathers understood not thy wonders in Egypt; they remembered not the multitude of thy mercies; but provoked him at the sea, even at the Red sea.<br>8 Nevertheless he saved them for his name's sake, that he might make his mighty power to be known.<br>9 He rebuked the Red sea also, and it was dried up: so he led them through the depths, as through the wilderness.<br>10 And he saved them from the hand of him that hated them, and redeemed them from the hand of the enemy.<br>11 And the waters covered their enemies: there was not one of them left.<br>12 Then believed they his words; they sang his praise.<br>13 They soon forgat his works; they waited not for his counsel:<br>14 But lusted exceedingly in the wilderness, and tempted Elohim in the desert.<br>15 And he gave them their request; but sent leanness into their soul.<br>16 They envied Moses also in the camp, and Aaron the saint of Yahweh.<br>17 The earth opened and swallowed up Dathan and covered the company of Abiram.<br>18 And a fire was kindled in their company; the flame burned up the wicked.<br>19 They made a calf in Horeb, and worshipped the molten image.<br>20 Thus they changed their glory into the similitude of an ox that eateth grass.<br>21 They forgat Elohim their saviour, which had done great things in Egypt;<br>22 Wondrous works in the land of Ham, and terrible things by the Red sea.<br>23 Therefore he said that he would destroy them, had not Moses his chosen stood before him in the breach, to turn away his wrath, lest he should destroy them.<br>24 Yea, they despised the pleasant land, they believed not his word:<br>25 But murmured in their tents, and hearkened not unto the voice of Yahweh.<br>26 Therefore he lifted up his hand against them, to overthrow them in the wilderness:<br>27 To overthrow their seed also among the nations, and to scatter them in the lands.<br>28 They joined themselves also unto Baalpeor, and ate the sacrifices of the dead.<br>29 Thus they provoked him to anger with their inventions: and the plague brake in upon them.<br>30 Then stood up Phinehas, and executed judgment: and so the plague was stayed.<br>31 And that was counted unto him for righteousness unto all generations for evermore.<br>32 They angered him also at the waters of strife, so that it went ill with Moses for their sakes:<br>33 Because they provoked his spirit, so that he spake unadvisedly with his lips.<br>34 They did not destroy the nations, concerning whom Yahweh commanded them:<br>35 But were mingled among the heathen, and learned their works.<br>36 And they served their idols: which were a snare unto them.<br>37 Yea, they sacrificed their sons and their daughters unto devils,<br>38 And shed innocent blood, even the blood of their sons and of their daughters, whom they sacrificed unto the idols of Canaan: and the land was polluted with blood.<br>39 Thus were they defiled with their own works, and went a whoring with their own inventions.<br>40 Therefore was the wrath of Yahweh kindled against his people, insomuch that he abhorred his own inheritance.<br>41 And he gave them into the hand of the heathen; and they that hated them ruled over them.<br>42 Their enemies also oppressed them, and they were brought into subjection under their hand.<br>43 Many times did he deliver them; but they provoked him with their counsel, and were brought low for their iniquity.<br>44 Nevertheless he regarded their affliction, when he heard their cry:<br>45 And he remembered for them his covenant, and repented according to the multitude of his mercies.<br>46 He made them also to be pitied of all those that carried them captives.<br>47 Save us, O Yahweh our Elohim, and gather us from among the heathen, to give thanks unto thy holy name, and to triumph in thy praise.<br>48 Blessed be Yahweh Elohim of Israel from everlasting to everlasting: and let all the people say, Amen. Praise ye Yahweh."
    },
    {
      "psalm": 107,
      "title": "Psalm 107 | \"O give thanks unto Yahweh, for He is good\"",
      "date": "Oct. 8th, 2024",
      "location": "Central Colorado",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-107-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/TpGZFzI8-0U",
      "audioUrl": "/audio/Psalm-107.mp3",
      "length": "5:33",
      "description": "1 O give thanks unto Yahweh, for He is good: for His mercy endureth for ever.<br>2 Let the redeemed of Yahweh say so, whom He hath redeemed from the hand of the enemy;<br>3 And gathered them out of the lands, from the east, and from the west, from the north, and from the south.<br>4 They wandered in the wilderness in a solitary way; they found no city to dwell in.<br>5 Hungry and thirsty, their soul fainted in them.<br>6 Then they cried unto Yahweh in their trouble, and He delivered them out of their distresses.<br>7 And He led them forth by the right way, that they might go to a city of habitation.<br>8 Oh that men would praise Yahweh for His goodness, and for His wonderful works to the children of men!<br>9 For He satisfieth the longing soul, and filleth the hungry soul with goodness.<br>10 Such as sit in darkness and in the shadow of death, being bound in affliction and iron;<br>11 Because they rebelled against the words of Elohim, and contemned the counsel of the most High:<br>12 Therefore He brought down their heart with labour; they fell down, and there was none to help.<br>13 Then they cried unto Yahweh in their trouble, and He saved them out of their distresses.<br>14 He brought them out of darkness and the shadow of death, and brake their bands in sunder.<br>15 Oh that men would praise Yahweh for His goodness, and for His wonderful works to the children of men!<br>16 For He hath broken the gates of brass, and cut the bars of iron in sunder.<br>17 Fools because of their transgression, and because of their iniquities, are afflicted.<br>18 Their soul abhorreth all manner of meat; and they draw near unto the gates of death.<br>19 Then they cry unto Yahweh in their trouble, and He saveth them out of their distresses.<br>20 He sent His word, and healed them, and delivered them from their destructions.<br>21 Oh that men would praise Yahweh for His goodness, and for His wonderful works to the children of men!<br>22 And let them sacrifice the sacrifices of thanksgiving, and declare His works with rejoicing.<br>23 They that go down to the sea in ships, that do business in great waters;<br>24 These see the works of Yahweh, and His wonders in the deep.<br>25 For He commandeth, and raiseth the stormy wind, which lifteth up the waves thereof.<br>26 They mount up to the heaven, they go down again to the depths: their soul is melted because of trouble.<br>27 They reel to and fro, and stagger like a drunken man, and are at their wit's end.<br>28 Then they cry unto Yahweh in their trouble, and He bringeth them out of their distresses.<br>29 He maketh the storm a calm, so that the waves thereof are still.<br>30 Then are they glad because they be quiet; so He bringeth them unto their desired haven.<br>31 Oh that men would praise Yahweh for His goodness, and for His wonderful works to the children of men!<br>32 Let them exalt Him also in the congregation of the people, and praise Him in the assembly of the elders.<br>33 He turneth rivers into a wilderness, and the watersprings into dry ground;<br>34 A fruitful land into barrenness, for the wickedness of them that dwell therein.c35 He turneth the wilderness into a standing water, and dry ground into watersprings.<br>36 And there He maketh the hungry to dwell, that they may prepare a city for habitation;<br>37 And sow the fields, and plant vineyards, which may yield fruits of increase.<br>38 He blesseth them also, so that they are multiplied greatly; and suffereth not their cattle to decrease.<br>39 Again, they are minished and brought low through oppression, affliction, and sorrow.<br>40 He poureth contempt upon princes, and causeth them to wander in the wilderness, where there is no way.<br>41 Yet setteth He the poor on high from affliction, and maketh Him families like a flock.<br>42 The righteous shall see it, and rejoice: and all iniquity shall stop her mouth.<br>43 Whoso is wise, and will observe these things, even they shall understand the lovingkindness of Yahweh."
    },
    {
      "psalm": 110,
      "title": "Psalm 110 | A royal and prophetic psalm",
      "date": "Apr. 16th, 2024",
      "location": "Central Minnesota",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-110-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/IwuZWa_gtG4",
      "audioUrl": "/audio/Psalm-110.mp3",
      "length": "1:35",
      "description": "We pray you are blessed and encouraged by this reading from Psalms 110, a Psalm of David.<br><br>1 Yahweh said unto my Sovereign, Sit Thou at My right hand, until I make Thine enemies Thy footstool.<br>2 Yahweh shall send the rod of Thy strength out of Zion: rule Thou in the midst of thine enemies.<br>3 Thy people shall be willing in the day of Thy power, in the beauties of holiness from the womb of the morning: Thou hast the dew of Thy youth.<br>4 Yahweh hath sworn, and will not repent, Thou art a priest for ever after the order of Melchizedek.<br>5 Yahweh at Thy right hand shall strike through kings in the day of His wrath.<br>6 He shall judge among the heathen, He shall fill the places with the dead bodies; He shall wound the heads over many countries.<br>7 He shall drink of the brook in the way: therefore shall He lift up the head."
    },
    {
      "psalm": 113,
      "title": "Psalm 113 | A joyful song of praise",
      "date": "Feb. 18th, 2026",
      "location": "Southwestern South Dakota",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-113-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/HGWS2Qg6FNc",
      "audioUrl": "/audio/Psalm-113.mp3",
      "length": "1:15",
      "description": "1 Praise ye Yahweh. Praise, O ye servants of Yahweh, praise the name of Yahweh.<br>2 Blessed be the name of Yahweh from this time forth and for evermore.<br>3 From the rising of the sun unto the going down of the same Yahweh's name is to be praised.<br>4 Yahweh is high above all nations, and his glory above the heavens.<br>5 Who is like unto Yahweh our Elohim, who dwelleth on high,<br>6 Who humbleth himself to behold the things that are in heaven, and in the earth!<br>7 He raiseth up the poor out of the dust, and lifteth the needy out of the dunghill;<br>8 That he may set him with princes, even with the princes of his people.<br>9 He maketh the barren woman to keep house, and to be a joyful mother of children. Praise ye Yahweh."
    },
    {
      "psalm": 114,
      "title": "Psalm 114 | \"The mountains skipped like rams\"",
      "date": "Sep. 1st, 2024",
      "location": "Central Colorado",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-114-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/8BrjN8kDTd4",
      "audioUrl": "/audio/Psalm-114.mp3",
      "length": "1:21",
      "description": "1 When Israel went out of Egypt, the house of Jacob from a people of strange language;<br>2 Judah was his sanctuary, and Israel his dominion.<br>3 The sea saw it, and fled: Jordan was driven back.<br>4 The mountains skipped like rams, and the little hills like lambs.<br>5 What ailed thee, O thou sea, that thou fleddest? thou Jordan, that thou wast driven back?<br>6 Ye mountains, that ye skipped like rams; and ye little hills, like lambs?<br>7 Tremble, thou earth, at the presence of the Sovereign, at the presence of the Eloah of Jacob;<br>8 Which turned the rock into a standing water, the flint into a fountain of waters."
    },
    {
      "psalm": 116,
      "title": "Psalm 116 | Thanksgiving for deliverance",
      "date": "Jan. 28th, 2024",
      "location": "Central Minnesota",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-116-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/O6-mBq8nG00",
      "audioUrl": "/audio/Psalm-116.mp3",
      "length": "3:00",
      "description": "Psalms 116 read in nature. This Psalm reading was filmed in the countryside of Minnesota.<br><br>1 I love Yahweh, because he hath heard my voice and my supplications.<br>2 Because he hath inclined his ear unto me, therefore will I call upon him as long as I live.<br>3 The sorrows of death compassed me, and the pains of hell gat hold upon me: I found trouble and sorrow.<br>4 Then called I upon the name of Yahweh; O Yahweh, I beseech thee, deliver my soul.<br>5 Gracious is Yahweh, and righteous; yea, our Elohim is merciful.<br>6 Yahweh preserveth the simple: I was brought low, and he helped me.<br>7 Return unto thy rest, O my soul; for Yahweh hath dealt bountifully with thee.<br>8 For thou hast delivered my soul from death, mine eyes from tears, and my feet from falling.<br>9 I will walk before Yahweh in the land of the living.<br>10 I believed, therefore have I spoken: I was greatly afflicted:<br>11 I said in my haste, All men are liars.<br>12 What shall I render unto Yahweh for all his benefits toward me?<br>13 I will take the cup of salvation, and call upon the name of Yahweh.<br>14 I will pay my vows unto Yahweh now in the presence of all his people.<br>15 Precious in the sight of Yahweh is the death of his saints.<br>16 O Yahweh, truly I am thy servant; I am thy servant, and the son of thine handmaid: thou hast loosed my bonds.<br>17 I will offer to thee the sacrifice of thanksgiving, and will call upon the name of Yahweh.<br>18 I will pay my vows unto Yahweh now in the presence of all his people,<br>19 in the courts of Yahwehs house, in the midst of thee, O Jerusalem."
    },
    {
      "psalm": 117,
      "title": "Psalm 117 | \"O praise Yahweh, all ye nations\"",
      "date": "Oct. 15th, 2023",
      "location": "Northwest Wisconsin",
      "time_of_day": "Midday",
      "image": "/images/thumbs/Psalms-117-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/s8vmXgcJUXQ",
      "audioUrl": "/audio/Psalm-117.mp3",
      "length": "1:39",
      "description": "Psalm 117, the shortest Psalm (and chapter) in the Bible, read in the forested hills of northern United States.<br><br>PSALM 117<br>1 O praise Yahweh, all ye nations: praise him, all ye people. <br> 2 For his merciful kindness is great toward us: and the truth of Yahweh endureth for ever. Praise ye Yahweh."
    },
   {
      "psalm": 118,
      "title": "Psalm 118 | Thanksgiving and praise",
      "date": "Mar. 30th, 2026",
      "location": "Northern Oregon",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-118-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/uUejxFADO1U",
      "audioUrl": "/audio/Psalm-118.mp3",
      "length": "4:04",
      "description": "<br>1 O give thanks unto Yahweh; for he is good: because his mercy endureth for ever.<br>2 Let Israel now say, that his mercy endureth for ever.<br>3 Let the house of Aaron now say, that his mercy endureth for ever.<br>4 Let them now that fear Yahweh say, that his mercy endureth for ever.<br>5 I called upon Yah in distress: Yah answered me, and set me in a large place.<br>6 Yahweh is on my side; I will not fear: what can man do unto me?<br>7 Yahweh taketh my part with them that help me: therefore shall I see my desire upon them that hate me.<br>8 It is better to trust in Yahweh than to put confidence in man.<br>9 It is better to trust in Yahweh than to put confidence in princes.<br>10 All nations compassed me about: but in the name of Yahweh will I destroy them.<br>11 They compassed me about; yea, they compassed me about: but in the name of Yahweh I will destroy them.<br>12 They compassed me about like bees: they are quenched as the fire of thorns: for in the name of Yahweh I will destroy them.<br>13 Thou hast thrust sore at me that I might fall: but Yahweh helped me.<br>14 Yah is my strength and song, and is become my salvation.<br>15 The voice of rejoicing and salvation is in the tabernacles of the righteous: the right hand of Yahweh doeth valiantly.<br>16 The right hand of Yahweh is exalted: the right hand of Yahweh doeth valiantly.<br>17 I shall not die, but live, and declare the works of Yah.<br>18 Yah hath chastened me sore: but he hath not given me over unto death.<br>19 Open to me the gates of righteousness: I will go into them, and I will praise Yah:<br>20 This gate of Yahweh, into which the righteous shall enter.<br>21 I will praise thee: for thou hast heard me, and art become my salvation.<br>22 The stone which the builders refused is become the head stone of the corner.<br>23 This is Yahweh's doing; it is marvellous in our eyes.<br>24 This is the day which Yahweh hath made; we will rejoice and be glad in it.<br>25 Save now, I beseech thee, O Yahweh: O Yahweh, I beseech thee, send now prosperity.<br>26 Blessed be he that cometh in the name of Yahweh: we have blessed you out of the house of Yahweh.<br>27 El is Yahweh, which hath shewed us light: bind the sacrifice with cords, even unto the horns of the altar.<br>28 Thou art my El, and I will praise thee: thou art my Elohim, I will exalt thee.<br>29 O give thanks unto Yahweh; for he is good: for his mercy endureth for ever.<br>"
    },
    {
      "psalm": 122,
      "title": "Psalm 122 | \"Pray for the peace of Jerusalem\"",
      "date": "Nov. 8th, 2025",
      "location": "Southwestern South Dakota",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-122-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/j5D2fG9SklU",
      "audioUrl": "/audio/Psalm-122.mp3",
      "length": "1:01",
      "description": "1 I was glad when they said unto me, Let us go into the house of Yahweh.<br>2 Our feet shall stand within thy gates, O Jerusalem.<br>3 Jerusalem is builded as a city that is compact together:<br>4 Whither the tribes go up, the tribes of Yahweh, unto the testimony of Israel, to give thanks unto the name of Yahweh.<br>5 For there are set thrones of judgment, the thrones of the house of David.<br>6 Pray for the peace of Jerusalem: they shall prosper that love thee.<br>7 Peace be within thy walls, and prosperity within thy palaces.<br>8 For my brethren and companions' sakes, I will now say, Peace be within thee.<br>9 Because of the house of Yahweh our Elohim I will seek thy good."
    },
    {
      "psalm": 123,
      "title": "Psalm 123 | \"Have mercy upon us, O Yahweh\"",
      "date": "April. 29th, 2026",
      "location": "Central Minnesota",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-123-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/d4dY2oCYIEY",
      "audioUrl": "/audio/Psalm-123.mp3",
      "length": "0:57",
      "description": "1 Unto thee lift I up mine eyes, O thou that dwellest in the heavens.<br>2 Behold, as the eyes of servants look unto the hand of their masters, and as the eyes of a maiden unto the hand of her mistress; so our eyes wait upon Yahweh our Elohim, until that he have mercy upon us.<br>3 Have mercy upon us, O Yahweh, have mercy upon us: for we are exceedingly filled with contempt.<br>4 Our soul is exceedingly filled with the scorning of those that are at ease, and with the contempt of the proud."
    },
    {
      "psalm": 126,
      "title": "Psalm 126 | A song of Ascents",
      "date": "Jan. 26th, 2026",
      "location": "Northeastern Utah",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-126-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/aI0SeR_LUVo",
      "audioUrl": "/audio/Psalm-126.mp3",
      "length": "0:58",
      "description": "1 When Yahweh turned again the captivity of Zion, we were like them that dream.<br>2 Then was our mouth filled with laughter, and our tongue with singing: then said they among the heathen, Yahweh hath done great things for them.<br>3 Yahweh hath done great things for us; whereof we are glad.<br>4 Turn again our captivity, O Yahweh, as the streams in the south.<br>5 They that sow in tears shall reap in joy.<br>6 He that goeth forth and weepeth, bearing precious seed, shall doubtless come again with rejoicing, bringing his sheaves with him."
    },
    {
      "psalm": 131,
      "title": "Psalm 131 | A Song of Ascents by David",
      "date": "Aug. 25th, 2024",
      "location": "Central Colorado",
      "time_of_day": "Midday",
      "image": "/images/thumbs/Psalms-131-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/wyuHg8lvu2I",
      "audioUrl": "/audio/Psalm-131.mp3",
      "length": "0:43",
      "description": "Psalm 131, a Song of Ascents, is attributed to David and is one of the shortest of the Psalms. We pray you are blessed and encouraged by this reading from Psalms 131.<br><br>1 Yahweh, my heart is not haughty, nor mine eyes lofty: neither do I exercise myself in great matters, or in things too high for me.<br>2 Surely I have behaved and quieted myself, as a child that is weaned of his mother: my soul is even as a weaned child.<br>3 Let Israel hope in Yahweh from henceforth and for ever."
    },
    {
      "psalm": 132,
      "title": "Psalm 132 | A song of degrees",
      "date": "Feb. 8th, 2026",
      "location": "Central Colorado",
      "time_of_day": "Evening",
      "image": "/images/thumbs/Psalms-132-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/PdpQHEhCFBI",
      "audioUrl": "/audio/Psalm-132.mp3",
      "length": "2:10",
      "description": "<br>1 Yahweh, remember David, and all his afflictions:<br>2 How he sware unto Yahweh, and vowed unto the mighty Elohim of Jacob;<br>3 Surely I will not come into the tabernacle of my house, nor go up into my bed;<br>4 I will not give sleep to mine eyes, or slumber to mine eyelids,<br>5 Until I find out a place for Yahweh, an habitation for the mighty Elohim of Jacob.<br>6 Lo, we heard of it at Ephratah: we found it in the fields of the wood.<br>7 We will go into his tabernacles: we will worship at his footstool.<br>8 Arise, O Yahweh, into thy rest; thou, and the ark of thy strength.<br>9 Let thy priests be clothed with righteousness; and let thy saints shout for joy.<br>10 For thy servant David's sake turn not away the face of thine anointed.<br>11 Yahweh hath sworn in truth unto David; he will not turn from it; Of the fruit of thy body will I set upon thy throne.<br>12 If thy children will keep my covenant and my testimony that I shall teach them, their children shall also sit upon thy throne for evermore.<br>13 For Yahweh hath chosen Zion; he hath desired it for his habitation.<br>14 This is my rest for ever: here will I dwell; for I have desired it.<br>15 I will abundantly bless her provision: I will satisfy her poor with bread.<br>16 I will also clothe her priests with salvation: and her saints shall shout aloud for joy.<br>17 There will I make the horn of David to bud: I have ordained a lamp for mine anointed.<br>18 His enemies will I clothe with shame: but upon himself shall his crown flourish.<br>"
    },
    {
      "psalm": 133,
      "title": "Psalm 133 | \"How pleasant it is for brethren to dwell together in unity\"",
      "date": "April 5th, 2026",
      "location": "Oregon Coast",
      "time_of_day": "Noon",
      "image": "/images/thumbs/Psalms-133-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/gpL9gqTF4Rg",
      "audioUrl": "/audio/Psalm-133.mp3",
      "length": "0:38",
      "description": "1 Behold, how good and how pleasant it is for brethren to dwell together in unity!<br>2 It is like the precious ointment upon the head, that ran down upon the beard, even Aaron's beard: that went down to the skirts of his garments;<br>3 As the dew of Hermon, and as the dew that descended upon the mountains of Zion: for there Yahweh commanded the blessing, even life for evermore."
    },
    {
      "psalm": 134,
      "title": "Psalm 134 | \"Bless ye Yahweh, all ye servants of Yahweh\"",
      "date": "Sep. 11th, 2024",
      "location": "Central Colorado",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-134-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/5coOBqknxrg",
      "audioUrl": "/audio/Psalm-134.mp3",
      "length": "0:32",
      "description": "A Song of Ascents.<br>1 Behold, bless ye Yahweh, all ye servants of Yahweh, which by night stand in the house of Yahweh.<br>2 Lift up your hands in the sanctuary, and bless Yahweh.<br>3 Yahweh that made heaven and earth bless thee out of Zion."
    },
    {
      "psalm": 135,
      "title": "Psalm 135 | \"Praise hymn\"",
      "date": "Dec. 31st, 2025",
      "location": "Oregon Coast",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-135-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/R7Q8j7m2Rpg",
      "audioUrl": "/audio/Psalm-135.mp3",
      "length": "2:30",
      "description": "<br>1 Praise ye Yahweh. Praise ye the name of Yahweh; praise him, O ye servants of Yahweh.<br>2 Ye that stand in the house of Yahweh, in the courts of the house of our Elohim.<br>3 Praise Yahweh; for Yahweh is good: sing praises unto his name; for it is pleasant.<br>4 For Yahweh hath chosen Jacob unto himself, and Israel for his peculiar treasure.<br>5 For I know that Yahweh is great, and that our Yahweh is above all mighty ones.<br>6 Whatsoever Yahweh pleased, that did he in heaven, and in earth, in the seas, and all deep places.<br>7 He causeth the vapours to ascend from the ends of the earth; he maketh lightnings for the rain; he bringeth the wind out of his treasuries.<br>8 Who smote the firstborn of Egypt, both of man and beast.<br>9 Who sent tokens and wonders into the midst of thee, O Egypt, upon Pharaoh, and upon all his servants.<br>10 Who smote great nations, and slew mighty kings;<br>11 Sihon king of the Amorites, and Og king of Bashan, and all the kingdoms of Canaan:<br>12 And gave their land for an heritage, an heritage unto Israel his people.<br>13 Thy name, O Yahweh, endureth for ever; and thy memorial, O Yahweh, throughout all generations.<br>14 For Yahweh will judge his people, and he will repent himself concerning his servants.<br>15 The idols of the heathen are silver and gold, the work of men's hands.<br>16 They have mouths, but they speak not;  eyes have they, but they see not;<br>17 They have ears, but they hear not; neither is there any breath in their mouths.<br>18 They that make them are like unto them: so is every one that trusteth in them.<br>19 Bless Yahweh, O house of Israel: bless Yahweh, O house of Aaron:<br>20 Bless Yahweh, O house of Levi: ye that fear Yahweh, bless Yahweh.<br>21 Blessed be Yahweh out of Zion, which dwelleth at Jerusalem. Praise ye Yahweh."
    },
    {
      "psalm": 136,
      "title": "Psalm 136 | \"For His mercy endureth for ever\"",
      "date": "Aug. 29th, 2024",
      "location": "Central Colorado",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-136-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/lBfPMvMXHsY",
      "audioUrl": "/audio/Psalm-136.mp3",
      "length": "3:09",
      "description": "Psalm 136 is a \"great praise\" psalm, filled with thanksgiving for Yahweh's mercy and what He has done. Each verse ends with the well-known refrain \"For His mercy endureth forever.\"<br><br>Although this psalm talks specifically about how Yahweh led Israel to victory against their enemies and gave them the land of inheritance, we should not feel that these lines of thanksgiving are far off from us today. Just as He \"overthrew Pharaoh\" for Israel and \"gave their land for an heritage\", Yahweh has delivered us from the enemy and given us a greater heritage to look forward to through His Son, Yahushua the Messiah.<br><br>It is so amazing to me how if you stop to ponder, you see that each Psalm ultimately does point back to the Messiah, either in a prophetic or symbolic sense (or both!).<br><br>We pray you are blessed and encouraged by this reading from Psalms 136.<br><br>1 O give thanks unto Yahweh; for He is good: for His mercy endureth for ever.<br>2 O give thanks unto Elohim of mighty ones: for His mercy endureth for ever.<br>3 O give thanks to the Sovereign of sovereigns: for His mercy endureth for ever.<br>4 To Him who alone doeth great wonders: for His mercy endureth for ever.<br>5 To Him that by wisdom made the heavens: for His mercy endureth for ever.<br>6 To Him that stretched out the earth above the waters: for His mercy endureth for ever.<br>7 To Him that made great lights: for His mercy endureth for ever:<br>8 The sun to rule by day: for His mercy endureth for ever:<br>9 The moon and stars to rule by night: for His mercy endureth for ever.<br>10 To Him that smote Egypt in their firstborn: for His mercy endureth for ever:<br>11 And brought out Israel from among them: for His mercy endureth for ever:<br>12 With a strong hand, and with a stretched out arm: for His mercy endureth for ever.<br>13 To Him which divided the Red sea into parts: for His mercy endureth for ever:<br>14 And made Israel to pass through the midst of it: for His mercy endureth for ever:<br>15 But overthrew Pharaoh and His host in the Red sea: for His mercy endureth for ever.<br>16 To Him which led His people through the wilderness: for His mercy endureth for ever.<br>17 To Him which smote great kings: for His mercy endureth for ever:<br>18 And slew famous kings: for His mercy endureth for ever:<br>19 Sihon king of the Amorites: for His mercy endureth for ever:<br>20 And Og the king of Bashan: for His mercy endureth for ever:<br>21 And gave their land for an heritage: for His mercy endureth for ever:<br>22 Even an heritage unto Israel His servant: for His mercy endureth for ever.<br>23 Who remembered us in our low estate: for His mercy endureth for ever:<br>24 And hath redeemed us from our enemies: for His mercy endureth for ever.<br>25 Who giveth food to all flesh: for His mercy endureth for ever.<br>26 O give thanks unto the Elohim of heaven: for His mercy endureth for ever."
    },
    {
      "psalm": 138,
      "title": "Psalm 138 | \"I will praise thee with my whole heart\"",
      "date": "Jan. 9th, 2026",
      "location": "Northeastern Utah",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-138-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/gWKN2CngtFA",
      "audioUrl": "/audio/Psalm-138.mp3",
      "length": "1:22",
      "description": "1 I will praise thee with my whole heart: before the mighty ones will I sing praise unto thee.<br>2 I will worship toward thy holy temple, and praise thy name for thy lovingkindness and for thy truth: for thou hast magnified thy word above all thy name.<br>3 In the day when I cried thou answeredst me, and strengthenedst me with strength in my soul.<br>4 All the kings of the earth shall praise thee, O Yahweh, when they hear the words of thy mouth.<br>5 Yea, they shall sing in the ways of the Yahweh: for great is the glory of Yahweh.<br>6 Though Yahweh be high, yet hath he respect unto the lowly: but the proud he knoweth afar off.<br>7 Though I walk in the midst of trouble, thou wilt revive me: thou shalt stretch forth thine hand against the wrath of mine enemies, and thy right hand shall save me.<br>8 Yahweh will perfect that which concerneth me: thy mercy, O Yahweh, endureth for ever: forsake not the works of thine own hands."
    },
    {
      "psalm": 139,
      "title": "Psalm 139 | \"O Yahweh, thou hast searched me, and known me\"",
      "date": "April. 15th, 2026",
      "location": "Washington",
      "time_of_day": "Evening",
      "image": "/images/thumbs/Psalms-139-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/sLEg4u3_0IU",
      "audioUrl": "/audio/Psalm-139.mp3",
      "length": "3:08",
      "description": "<br>1 O Yahweh, thou hast searched me, and known me.<br>2 Thou knowest my downsitting and mine uprising, thou understandest my thought afar off.<br>3 Thou compassest my path and my lying down, and art acquainted with all my ways.<br>4 For there is not a word in my tongue, but, lo, O Yahweh, thou knowest it altogether.<br>5 Thou hast beset me behind and before, and laid thine hand upon me.<br>6 Such knowledge is too wonderful for me; it is high, I cannot attain unto it.<br>7 Whither shall I go from thy spirit? or whither shall I flee from thy presence?<br>8 If I ascend up into heaven, thou art there: if I make my bed in the grave, behold, thou art there.<br>9 If I take the wings of the morning, and dwell in the uttermost parts of the sea;<br>10 Even there shall thy hand lead me, and thy right hand shall hold me.<br>11 If I say, Surely the darkness shall cover me; even the night shall be light about me.<br>12 Yea, the darkness hideth not from thee; but the night shineth as the day: the darkness and the light are both alike to thee.<br>13 For thou hast possessed my reins: thou hast covered me in my mother's womb.<br>14 I will praise thee; for I am fearfully and wonderfully made: marvellous are thy works; and that my soul knoweth right well.<br>15 My substance was not hid from thee, when I was made in secret, and curiously wrought in the lowest parts of the earth.<br>16 Thine eyes did see my substance, yet being unperfect; and in thy book all my members were written, which in continuance were fashioned, when as yet there was none of them.<br>17 How precious also are thy thoughts unto me, O El! how great is the sum of them!<br>18 If I should count them, they are more in number than the sand: when I awake, I am still with thee.<br>19 Surely thou wilt slay the wicked, O Eloha: depart from me therefore, ye bloody men.<br>20 For they speak against thee wickedly, and thine enemies take thy name in vain.<br>21 Do not I hate them, O Yahweh, that hate thee? and am not I grieved with those that rise up against thee?<br>22 I hate them with perfect hatred: I count them mine enemies.<br>23 Search me, O El, and know my heart: try me, and know my thoughts:<br>24 And see if there be any wicked way in me, and lead me in the way everlasting.<br>"
    },
    {
      "psalm": 141,
      "title": "Psalm 141 | Prayer for protection from evil and temptation",
      "date": "Mar. 10th, 2026",
      "location": "Southern Missouri",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-141-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/rvP7rwuxLl8",
      "audioUrl": "/audio/Psalm-141.mp3",
      "length": "1:36",
      "description": "<br>1 Yahweh, I cry unto thee: make haste unto me; give ear unto my voice, when I cry unto thee.<br>2 Let my prayer be set forth before thee as incense; and the lifting up of my hands as the evening sacrifice.<br>3 Set a watch, O Yahweh, before my mouth; keep the door of my lips.<br>4 Incline not my heart to any evil thing, to practice wicked works with men that work iniquity: and let me not eat of their dainties.<br>5 Let the righteous smite me; it shall be a kindness: and let him reprove me; it shall be an excellent oil, which shall not break my head: for yet my prayer also shall be in their calamities.<br>6 When their judges are overthrown in stony places, they shall hear my words; for they are sweet.<br>7 Our bones are scattered at the grave's mouth, as when one cutteth and cleaveth wood upon the earth.<br>8 But mine eyes are unto thee, O Yahweh my Sovereign: in thee is my trust; leave not my soul destitute.<br>9 Keep me from the snares which they have laid for me, and the gins of the workers of iniquity.<br>10 Let the wicked fall into their own nets, whilst that I withal escape.<br>"
    },
    {
      "psalm": 142,
      "title": "Psalm 142 | \"I cried unto Yahweh with my voice\"",
      "date": "Mar. 15th, 2026",
      "location": "Southwestern South Dakota",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-142-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/uOXsFoH56JQ",
      "audioUrl": "/audio/Psalm-142.mp3",
      "length": "1:15",
      "description": "1 I cried unto Yahweh with my voice; with my voice unto Yahweh did I make my supplication.<br>2 I poured out my complaint before him; I shewed before him my trouble.<br>3 When my spirit was overwhelmed within me, then thou knewest my path. In the way wherein I walked have they privily laid a snare for me.<br>4 I looked on my right hand, and beheld, but there was no man that would know me: refuge failed me; no man cared for my soul.<br>5 I cried unto thee, O Yahweh: I said, Thou art my refuge and my portion in the land of the living.<br>6 Attend unto my cry; for I am brought very low: deliver me from my persecutors; for they are stronger than I.<br>7 Bring my soul out of prison, that I may praise thy name: the righteous shall compass me about; for thou shalt deal bountifully with me."
    },
    {
      "psalm": 144,
      "title": "Psalm 144 | \"What is man, that Thou takest knowledge of him!\"",
      "date": "May. 14th, 2025",
      "location": "Central Minnesota",
      "time_of_day": "Morning",
      "image": "/images/thumbs/Psalms-144-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/qxCI7SEsuwA",
      "audioUrl": "/audio/Psalm-144.mp3",
      "length": "2:33",
      "description": "1 Blessed be Yahweh my strength which teacheth my hands to war, and my fingers to fight:<br>2 My goodness, and my fortress; my high tower, and my deliverer; my shield, and He in whom I trust; who subdueth my people under me.<br>3 Yahweh, what is man, that Thou takest knowledge of him! or the son of man, that Thou makest account of him!<br>4 Man is like to vanity: his days are as a shadow that passeth away.<br>5 Bow thy heavens, O Yahweh, and come down: touch the mountains, and they shall smoke.<br>6 Cast forth lightning, and scatter them: shoot out thine arrows, and destroy them.<br>7 Send Thine hand from above; rid me, and deliver me out of great waters, from the hand of strange children;<br>8 Whose mouth speaketh vanity, and their right hand is a right hand of falsehood.<br>9 I will sing a new song unto Thee, O Elohim: upon a psaltery and an instrument of ten strings will I sing praises unto Thee.<br>10 It is He that giveth salvation unto kings: who delivereth David His servant from the hurtful sword.<br>11 Rid me, and deliver me from the hand of strange children, whose mouth speaketh vanity, and their right hand is a right hand of falsehood:<br>12 That our sons may be as plants grown up in their youth; that our daughters may be as corner stones, polished after the similitude of a palace:<br>13 That our garners may be full, affording all manner of store: that our sheep may bring forth thousands and ten thousands in our streets:<br>14 That our oxen may be strong to labour; that there be no breaking in, nor going out; that there be no complaining in our streets.<br>15 Happy is that people, that is in such a case: yea, happy is that people, whose Elohim is Yahweh."
    },
    {
      "psalm": 146,
      "title": "Psalm 146 | \"Praise Yahweh my soul\"",
      "date": "Feb. 20th, 2026",
      "location": "Northeastern Utah",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-146-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/-zbVseLrTl8",
      "audioUrl": "/audio/Psalm-146.mp3",
      "length": "2:33",
      "description": "<br>1 Praise ye Yah. Praise Yahweh, O my soul.<br>2 While I live will I praise Yahweh: I will sing praises unto my Elohim while I have any being.<br>3 Put not your trust in princes, nor in the son of man, in whom there is no help.<br>4 His breath goeth forth, he returneth to his earth; in that very day his thoughts perish.<br>5 Happy is he that hath the El of Jacob for his help, whose hope is in Yahweh his Elohim:<br>6 Which made heaven, and earth, the sea, and all that therein is: which keepeth truth for ever:<br>7 Which executeth judgment for the oppressed: which giveth food to the hungry. Yahweh looseth the prisoners:<br>8 Yahweh openeth the eyes of the blind: Yahweh raiseth them that are bowed down: Yahweh loveth the righteous:<br>9 Yahweh preserveth the strangers; he relieveth the fatherless and widow: but the way of the wicked he turneth upside down.<br>10 Yahweh shall reign for ever, even thy Elohim, O Zion, unto all generations. Praise ye Yahweh.<br>"
    },
    {
      "psalm": 148,
      "title": "Psalm 148 | Praise for Yahweh's creation",
      "date": "Jan. 22nd, 2026",
      "location": "Northeastern Utah",
      "time_of_day": "Afternoon",
      "image": "/images/thumbs/Psalms-148-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/HyF8FoTcwhI",
      "audioUrl": "/audio/Psalm-148.mp3",
      "length": "1:41",
      "description": "<br>1 Praise ye Yahweh. Praise ye Yahweh from the heavens: praise him in the heights.<br>2 Praise ye him, all his angels: praise ye him, all his hosts.<br>3 Praise ye him, sun and moon: praise him, all ye stars of light.<br>4 Praise him, ye heavens of heavens, and ye waters that be above the heavens.<br>5 Let them praise the name of Yahweh: for he commanded, and they were created.<br>6 He hath also stablished them for ever and ever: he hath made a decree which shall not pass.<br>7 Praise Yahweh from the earth, ye dragons, and all deeps:<br>8 Fire, and hail; snow, and vapours; stormy wind fulfilling his word:<br>9 Mountains, and all hills; fruitful trees, and all cedars:<br>10 Beasts, and all cattle; creeping things, and flying fowl:<br>11 Kings of the earth, and all people; princes, and all judges of the earth:<br>12 Both young men, and maidens; old men, and children:<br>13 Let them praise the name of Yahweh: for his name alone is excellent; his glory is above the earth and heaven.<br>14 He also exalteth the horn of his people, the praise of all his saints; even of the children of Israel, a people near unto him. Praise ye Yahweh.<br>"
    },
    {
      "psalm": 149,
      "title": "Psalm 149 | Praise psalm",
      "date": "May 21st, 2024",
      "location": "Central Minnesota",
      "time_of_day": "Noon",
      "image": "/images/thumbs/Psalms-149-thumbnail.jpg",
      "videoUrl": "https://www.youtube-nocookie.com/embed/76QYB3O2RSE",
      "audioUrl": "/audio/Psalm-149.mp3",
      "length": "1:29",
      "description": "We pray you are blessed and encouraged by this reading from Psalms 149. (See if you can spot the squirrel who decided to be a part of the video!)<br><br>1 Praise ye Yah. Sing unto Yahweh a new song, and His praise in the congregation of saints.<br>2 Let Israel rejoice in Him that made him: let the children of Zion be joyful in their King.<br>3 Let them praise His name in the dance: let them sing praises unto Him with the timbrel and harp.<br>4 For Yahweh taketh pleasure in his people: He will beautify the meek with salvation.<br>5 Let the saints be joyful in glory: let them sing aloud upon their beds.<br>6 Let the high praises of El be in their mouth, and a two-edged sword in their hand;<br>7 To execute vengeance upon the heathen, and punishments upon the people;<br>8 To bind their kings with chains, and their nobles with fetters of iron;<br>9 To execute upon them the judgment written: this honour have all His saints. Praise ye Yah."
    }
  ],
  "psalms_location_table": [
    {
      "label": "Mountain",
      "items": [
        {
          "label": "morning",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 2 (could be evening on mountain top)"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 31"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 36"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 69"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 78"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 105"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 106"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 134"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 136"
            }
          ]
        },
        {
          "label": "midday",
          "psalms": [
            {
              "weather": "cloudy",
              "chapter": "Psalm 77"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 81"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 89"
            }
          ]
        },
        {
          "label": "afternoon",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 14"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 53"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 60"
            },
            {
              "weather": "cloudy",
              "chapter": "Psalm 61"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 62"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 114"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 136"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 148"
            }
          ]
        }
      ]
    },
    {
      "label": "Mountain top",
      "items": [
        {
          "label": "morning",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 28"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 48"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 65"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 125"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 143 (sunrise)"
            }
          ]
        },
        {
          "label": "midday",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 131"
            }
          ]
        },
        {
          "label": "afternoon",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 72"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 87"
            },
            {
              "weather": "cloudy",
              "chapter": "Psalm 90"
            },
            {
              "weather": "cloudy",
              "chapter": "Psalm 97"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 107"
            }
          ]
        },
        {
          "label": "evening",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 17"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 36"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 64"
            }
          ]
        }
      ]
    },
    {
      "label": "Grassy Meadow/Plain",
      "items": [
        {
          "label": "morning",
          "psalms": [
            {
              "weather": "foggy",
              "chapter": "Psalm 13"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 20"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 39"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 66"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 80"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 95"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 100 (by a stream)"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 128"
            }
          ]
        },
        {
          "label": "midday",
          "psalms": [
            {
              "weather": "rainy",
              "chapter": "Psalm 12"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 74"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 84"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 108"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 129"
            }
          ]
        },
        {
          "label": "afternoon",
          "psalms": [
            {
              "weather": "rainy",
              "chapter": "Psalm 3"
            },
            {
              "weather": "rainy",
              "chapter": "Psalm 4"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 9"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 26"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 37"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 57"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 103"
            }
          ]
        }
      ]
    },
    {
      "label": "Stream",
      "items": [
        {
          "label": "morning",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 71"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 73"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 101"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 124"
            }
          ]
        },
        {
          "label": "midday",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 79"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 141"
            }
          ]
        },
        {
          "label": "afternoon",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 34"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 41"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 46"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 51"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 54"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 59"
            }
          ]
        }
      ]
    },
    {
      "label": "River",
      "items": [
        {
          "label": "morning",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 1"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 5 (sunrise)"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 47"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 109"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 120"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 123"
            }
          ]
        },
        {
          "label": "midday",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 138"
            }
          ]
        },
        {
          "label": "afternoon",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 75"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 86"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 88"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 94"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 126"
            }
          ]
        },
        {
          "label": "evening",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 55"
            }
          ]
        }
      ]
    },
    {
      "label": "Lake",
      "items": [
        {
          "label": "morning",
          "psalms": [
            {
              "weather": "foggy",
              "chapter": "Psalm 27 (with trees)"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 54"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 93"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 127"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 130"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 140"
            }
          ]
        },
        {
          "label": "midday",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 76"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 85"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 145"
            }
          ]
        },
        {
          "label": "afternoon",
          "psalms": [
            {
              "weather": "cloudy",
              "chapter": "Psalm 6"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 24"
            },
            {
              "weather": "cloudy",
              "chapter": "Psalm 29"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 32"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 33 (with trees)"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 44"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 111"
            }
          ]
        }
      ]
    },
    {
      "label": "Woods/Forest",
      "items": [
        {
          "label": "morning",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 7"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 30"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 52"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 91"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 110"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 144"
            }
          ]
        },
        {
          "label": "midday",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 42 (with stream nearby)"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 116"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 149"
            }
          ]
        },
        {
          "label": "afternoon",
          "psalms": [
            {
              "weather": "cloudy",
              "chapter": "Psalm 18"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 35"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 49"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 96"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 104"
            }
          ]
        }
      ]
    },
    {
      "label": "Waterfall",
      "items": [
        {
          "label": "morning",
          "psalms": [
            {
              "weather": "foggy",
              "chapter": "Psalm 16"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 25"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 92"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 102"
            }
          ]
        },
        {
          "label": "midday",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 50"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 115"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 118"
            }
          ]
        },
        {
          "label": "afternoon",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 40"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 68"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 70"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 82"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 92"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 112"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 147"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 150"
            }
          ]
        }
      ]
    },
    {
      "label": "Hill",
      "items": [
        {
          "label": "morning",
          "psalms": [
            {
              "weather": "cloudy",
              "chapter": "Psalm 10"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 22"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 38"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 43"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 113"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 117"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 134"
            }
          ]
        },
        {
          "label": "midday",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 15"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 122"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 138"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 142"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 146"
            }
          ]
        },
        {
          "label": "afternoon",
          "psalms": [
            {
              "weather": "cloudy",
              "chapter": "Psalm 21"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 58"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 67"
            },
            {
              "weather": "cloudy",
              "chapter": "Psalm 83"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 99"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 121"
            }
          ]
        },
        {
          "label": "evening",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 8 (stars and moon)"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 19 (stars and moon)"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 56"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 132"
            }
          ]
        }
      ]
    },
    {
      "label": "Ocean",
      "items": [
        {
          "label": "morning",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 42"
            }
          ]
        },
        {
          "label": "afternoon",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 98"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 133"
            }
          ]
        }
      ]
    },
    {
      "label": "Desert",
      "items": [
        {
          "label": "morning",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 11"
            },
            {
              "weather": "sunny",
              "chapter": "Psalm 63"
            }
          ]
        }
      ]
    },
    {
      "label": "Still water by a tree",
      "items": [
        {
          "label": "afternoon",
          "psalms": [
            {
              "weather": "sunny",
              "chapter": "Psalm 23 (sheep)"
            }
          ]
        }
      ]
    }
  ],
  "psalms_locations": [
    {
      "psalm": 1,
      "completed": false,
      "time_of_day": "Morning",
      "location": "River",
      "weather": "sunny",
      "verses": 6,
      "categories": [
        "Wisdom"
      ],
      "tags": [
        "A Psalm of a righteous man", "Tree planted by the rivers of water", "Summer", "Fruit tree", "Wind", "Encouragement", "Instruction", "Judgement on evil"
      ]
    },
    {
      "psalm": 2,
      "completed": false,
      "time_of_day": "Morning/Evening",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 12,
      "categories": [
        "Kingship-Covenant/Theocratic/Human King"
      ],
      "tags": [
        "A Psalm about Yahweh the Father and Yahushua the Son", "Holy hill", "Judgement on evil", "Yahweh's power", "All will bow to Yahushua", "Ends of the earth"
      ]
    },
    {
      "psalm": 3,
      "completed": true,
      "time_of_day": "Evening/Afternoon",
      "location": "Meadow/Hill/Mountain",
      "weather": "rainy",
      "verses": 8,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        "Crying out for deliverance", "Yahweh's protection", "Holy hill", "Laying down to sleep", "Trust in Yahweh", "Protection"
      ]
    },
    {
      "psalm": 4,
      "completed": true,
      "time_of_day": "Evening",
      "location": "Meadow/Hill/Mountain",
      "weather": "rainy",
      "verses": 8,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        "The evening Psalm", "Crying out for deliverance", "Light", "Lie down and sleep", "Trust in Yahweh", "Protection"
      ]
    },
    {
      "psalm": 5,
      "completed": true,
      "time_of_day": "Morning sunrise",
      "location": "River",
      "weather": "sunny",
      "verses": 12,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        "The morning Psalm", "River", "Calling out to Yahweh", "Morning prayer", "Judgement on evil", "Mercy", "Worship", "Shout for joy", "Prayer for guidance"
      ]
    },
    {
      "psalm": 6,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Lake",
      "weather": "cloudy",
      "verses": 10,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        "A penitental Psalm", "Crying out for mercy", "Forgiveness", "How long? Psalm", "Night", "tears"
      ]
    },
    {
      "psalm": 7,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Woods/Forest",
      "weather": "sunny",
      "verses": 17,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        "Crying out for deliverance", "Judgement on evil", "Praise", "Judgement of the righteous", "Defense in Yahweh"
      ]
    },
    {
      "psalm": 8,
      "completed": true,
      "time_of_day": "Evening night with stars and moon",
      "location": "Hill",
      "weather": "sunny",
      "verses": 9,
      "categories": [
        "Praise/Creator"
      ],
      "tags": [
        "A Creation Psalm", "Hill", "Yahweh's power and glory", "Smallness of man", "Nature"
      ]
    },
    {
      "psalm": 9,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 20,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        "An arostic Psalm", "Praise for Yahweh's works", "Destruction and judgement of the wicked", "Yahweh is a refuge for the oppressed", "Yahweh's mercy", "Unbelievers sunk in a pit", "Yahweh's care for the humble and needy"
      ]
    },
    {
      "psalm": 10,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Hill",
      "weather": "cloudy",
      "verses": 18,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        "An arostic Psalm", "A Psalm of the wicked", "Persecution", "Evil men", "Crying to Yahweh to see the evil and judge it", "Yahweh is a helper to the fatherless and humble"
      ]
    },
    {
      "psalm": 11,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Desert",
      "weather": "cloudy",
      "verses": 7,
      "categories": [
        "Song of Trust"
      ],
      "tags": [
        "Trust in Yahweh", "Yahweh's Holy temple and throne", "Judgement of the wicked", "Yahweh's care for the righteous"
      ]
    },
    {
      "psalm": 12,
      "completed": false,
      "time_of_day": "Midday",
      "location": "Meadow",
      "weather": "rainy",
      "verses": 8,
      "categories": [
        "Lament/National/Individual"
      ],
      "tags": [
        "Judgement on evil", "Help for the poor and oppressed", "Yahweh's pure words, tried and purified in the furnace of earth"
      ]
    },
    {
      "psalm": 13,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Meadow",
      "weather": "foggy",
      "verses": 6,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        "The How long? Psalm", "Sorrow", "Sing unto Yahweh", "Crying out for deliverance"
      ]
    },
    {
      "psalm": 14,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 7,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        "A Psalm of the wicked", "All have sinned", "No-one does good"
      ]
    },
    {
      "psalm": 15,
      "completed": true,
      "time_of_day": "Midday",
      "location": "Hill",
      "weather": "sunny",
      "verses": 5,
      "categories": [
        "Wisdom"
      ],
      "tags": [
        "Instruction", "Truth", "Righteousness"
      ]
    },
    {
      "psalm": 16,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Waterfall",
      "weather": "foggy",
      "verses": 11,
      "categories": [
        "Song of Trust"
      ],
      "tags": [
        "A Messianic Psalm (prophecy of Yahushua)", "Yahweh is my portion and cup", "We will not be moved", "Joy"
      ]
    },
    {
      "psalm": 17,
      "completed": false,
      "time_of_day": "Evening",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 15,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        "Crying to Yahweh to prove him", "Prayer for deliverance from the wicked"
      ]
    },
    {
      "psalm": 18,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Woods/Forest",
      "weather": "cloudy",
      "verses": 50,
      "categories": [
        "Thanksgiving/Individual", "Thanksgiving/Kingship-Covenant"
      ],
      "tags": [
        "A Messianic Psalm (prophecy of Yahushua)", "Yahweh is our rock and our high tower", "Crying out for deliverance", "Yahweh's power over creation", "Yahweh's salvation", "Yahweh's protection", "Praise"
      ]
    },
    {
      "psalm": 19,
      "completed": false,
      "time_of_day": "Evening night with stars and moon",
      "location": "Hilltop",
      "weather": "sunny",
      "verses": 14,
      "categories": [
        "Praise hymn/Creator", "Wisdom"
      ],
      "tags": [
        "A word of Yahweh Psalm", "Yahweh's creation", "Yahweh's law", "Plea for help to avoid sin", "In awe of Yahweh"
      ]
    },
    {
      "psalm": 20,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 9,
      "categories": [
        "Kingship-Covenant/Theocratic/Human King"
      ],
      "tags": [
        "Yahweh's help", "Rejoice in Yahweh's salvation", "Yahweh's saves His anointed", "Trust in Yahweh"
      ]
    },
    {
      "psalm": 21,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Hill",
      "weather": "cloudy",
      "verses": 13,
      "categories": [
        "Kingship-Covenant/Theocratic/Human King"
      ],
      "tags": [
        "Rejoice in Yahweh's salvation", "Life", "Righteous judgement upon the wicked", "Yahweh hears the righteous"
      ]
    },
    {
      "psalm": 22,
      "completed": true,
      "time_of_day": "Morning sunrise",
      "location": "Hill",
      "weather": "sunny",
      "verses": 31,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        "Psalm of the good shepherd", "A Messianic Psalm (prophecy of Yahushua)", "Crying out to Yahweh", "Asking why Yahweh feels far away", "Praising Yahweh for His Holiness", "The whole earth remembers and turns to Yahweh"
      ]
    },
    {
      "psalm": 23,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Still water with sheep nearby",
      "weather": "sunny",
      "verses": 6,
      "categories": [
        "Song of Trust"
      ],
      "tags": [
        "Psalm of the great shepherd", "Yahweh is my shepherd", "Yahweh is our protector, provider, and guide", "No fear of evil"
      ]
    },
    {
      "psalm": 24,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Lake",
      "weather": "sunny",
      "verses": 10,
      "categories": [
        "Kingship-Covenant/Yahweh as Divine King"
      ],
      "tags": [
        "Psalm of the Chief shepherd", "A Messianic Psalm (prophecy of Yahushua)", "The earth and the world is Yahweh's", "Those that seek Yahweh and do His will (righteousness) receive blessings and salvation from Yahweh", "Yahweh is the king of glory"
      ]
    },
    {
      "psalm": 25,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Waterfall",
      "weather": "sunny",
      "verses": 22,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        "An arostic Psalm", "Trust in Yahweh", "Let not mine enemies triumph over me", "Asking Yahweh to guide and lead in His truth", "Don't remember the sins of youth", "Pardon sins", "Prayer to look upon affliction", "Prayer for deliverance from the wicked"
      ]
    },
    {
      "psalm": 26,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 12,
      "categories": [
        "Lament/Individual/Request in Prayer"
      ],
      "tags": [
        "Praise Yahweh", "Prayer for examination of Yahweh", "Thanksgiving"
      ]
    },
    {
      "psalm": 27,
      "completed": false,
      "time_of_day": "Morning sunrise",
      "location": "Lake with Trees",
      "weather": "foggy",
      "verses": 14,
      "categories": [
        "Song of Trust"
      ],
      "tags": [
        "Yahweh is my light and salvation", "Yahweh is my strength", "Yahweh protects", "Seeking to dwell in Yahweh's presence", "Crying out to Yahweh", "Seeking Yahweh's face", "Asking for Yahweh to teach", "Seeking deliverance from enemies", "Waiting on Yahweh"
      ]
    },
    {
      "psalm": 28,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 9,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        "Crying out to Yahweh", "Yahweh is a rock", "Pleading for justice", "Praise that Yahweh hears", "Yahweh is a strength and shield", "Rejoicing in Yahweh"
      ]
    },
    {
      "psalm": 29,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Lake",
      "weather": "cloudy",
      "verses": 11,
      "categories": [
        "Praise hymn/Creator", "Kingship-Covenant/Yahweh as Divine King"
      ],
      "tags": [
        "The voice of Yahweh psalm", "Praise for Yahweh's works", "Give the glory due to His name", "Waters", "Cedars", "Wilderness", "Forest", "Yahweh gives strength and blesses His people"
      ]
    },
    {
      "psalm": 30,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Woods/Forest",
      "weather": "rainy",
      "verses": 12,
      "categories": [
        "Thanksgiving/Individual"
      ],
      "tags": [
        "Crying out to Yahweh", "Thanksgiving to Yahweh for deliverance", "Singing praise to Yahweh", "Weeping may endure for a night but joy comes in the morning"
      ]
    },
    {
      "psalm": 31,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 24,
      "categories": [
        "Lament/Individual", "Song of Trust"
      ],
      "tags": [
        "A Messianic Psalm (prophecy of Yahushua)", "Psalm of deliverance", "Yahweh is my rock and fortress", "House of deliverance", "Prayer for deliverance", "Prayer for guidance", "Hating lying vanities", "Plea for mercy and deliverance from afflictions", "Like a broken vessel", "May Thy face shine upon me", "Yahweh's goodness", "Be of good courage and He shall strengthen your heart"
      ]
    },
    {
      "psalm": 32,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Lake",
      "weather": "sunny",
      "verses": 11,
      "categories": [
        "Thanksgiving/Individual"
      ],
      "tags": [
        "A penitental Psalm", "Blessed is the one who is forgiven by Yahweh", "My bones waxed old", "Acknowledgement of sin", "Confession of sin", "Floods of great waters", "Yahweh is a hiding place who preserves from troubles", "Glad in Yahweh"
      ]
    },
    {
      "psalm": 33,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Lake with Trees",
      "weather": "sunny",
      "verses": 22,
      "categories": [
        "Praise hymn", "Yahweh of History"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 34,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Stream",
      "weather": "sunny",
      "verses": 22,
      "categories": [
        "Thanksgiving/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 35,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Woods/Forest",
      "weather": "sunny",
      "verses": 28,
      "categories": [
        "Lament/Individual/Imprecatory"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 36,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 12,
      "categories": [
        "Wisdom"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 37,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 40,
      "categories": [
        "Wisdom"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 38,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Hill",
      "weather": "sunny",
      "verses": 22,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 39,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 13,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 40,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Waterfall",
      "weather": "sunny",
      "verses": 17,
      "categories": [
        "Thanksgiving/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 41,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Stream",
      "weather": "sunny",
      "verses": 13,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 42,
      "completed": true,
      "time_of_day": "Midday",
      "location": "Stream with woods nearby",
      "weather": "sunny",
      "verses": 11,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 43,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Hill",
      "weather": "sunny",
      "verses": 5,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 44,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Lake",
      "weather": "sunny",
      "verses": 26,
      "categories": [
        "Lament/National/Penitential"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 45,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Ocean",
      "weather": "sunny",
      "verses": 17,
      "categories": [
        "Kingship-Covenant/Theocratic/Human King"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 46,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Stream",
      "weather": "sunny",
      "verses": 11,
      "categories": [
        "Praise hymn/Song of Zion"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 47,
      "completed": true,
      "time_of_day": "Morning",
      "location": "River",
      "weather": "sunny",
      "verses": 9,
      "categories": [
        "Kingship-Covenant/Yahweh as Divine King", "Praise hymn/Yahweh as Divine King"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 48,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 14,
      "categories": [
        "Praise hymn/Song of Zion"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 49,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Woods/Forest",
      "weather": "sunny",
      "verses": 20,
      "categories": [
        "Wisdom"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 50,
      "completed": false,
      "time_of_day": "Midday",
      "location": "Waterfall",
      "weather": "sunny",
      "verses": 23,
      "categories": [
        "Kingship-Covenant/Creator"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 51,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Stream",
      "weather": "sunny",
      "verses": 19,
      "categories": [
        "Lament/Individual/Penitential"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 52,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Woods/Forest",
      "weather": "sunny",
      "verses": 9,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 53,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 6,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 54,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Stream",
      "weather": "sunny",
      "verses": 7,
      "categories": [
        "Lament/Individual", "Song of Trust"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 55,
      "completed": false,
      "time_of_day": "Evening night with stars and moon",
      "location": "River",
      "weather": "sunny",
      "verses": 23,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 56,
      "completed": true,
      "time_of_day": "Evening night with stars and moon",
      "location": "Hill",
      "weather": "sunny",
      "verses": 13,
      "categories": [
        "Lament/Individual", "Song of Trust"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 57,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 11,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 58,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 11,
      "categories": [
        "Lament/National", "Praise hymn/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 59,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Stream",
      "weather": "sunny",
      "verses": 17,
      "categories": [
        "Lament/Individual/Imprecatory"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 60,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 12,
      "categories": [
        "Lament/National", "Praise hymn"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 61,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Mountain/Mountain Top",
      "weather": "cloudy",
      "verses": 8,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 62,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 12,
      "categories": [
        "Song of Trust"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 63,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Desert",
      "weather": "sunny",
      "verses": 11,
      "categories": [
        "Song of Trust"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 64,
      "completed": false,
      "time_of_day": "Evening",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 10,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 65,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Mountain Top",
      "weather": "sunny",
      "verses": 13,
      "categories": [
        "Thanksgiving/National"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 66,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 20,
      "categories": [
        "Thanksgiving/Individual", "Thanksgiving/National"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 67,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Hill",
      "weather": "sunny",
      "verses": 7,
      "categories": [
        "Thanksgiving/National"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 68,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Waterfall",
      "weather": "sunny",
      "verses": 35,
      "categories": [
        "Praise hymn", "Kingship-Covenant/Yahweh as Divine King"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 69,
      "completed": true,
      "time_of_day": "Morning sunrise",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 36,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 70,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 5,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 71,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Stream",
      "weather": "sunny",
      "verses": 24,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 72,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Mountain Top",
      "weather": "sunny",
      "verses": 20,
      "categories": [
        "Kingship-Covenant/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 73,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Stream",
      "weather": "sunny",
      "verses": 28,
      "categories": [
        "Wisdom"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 74,
      "completed": false,
      "time_of_day": "Midday",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 23,
      "categories": [
        "Lament/Penitential"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 75,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "River",
      "weather": "sunny",
      "verses": 10,
      "categories": [
        "Thanksgiving/National"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 76,
      "completed": false,
      "time_of_day": "Midday",
      "location": "Lake",
      "weather": "sunny",
      "verses": 12,
      "categories": [
        "Praise hymn/Song of Zion"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 77,
      "completed": false,
      "time_of_day": "Midday",
      "location": "Mountain/Mountain Top",
      "weather": "cloudy",
      "verses": 20,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 78,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 72,
      "categories": [
        "Wisdom", "Praise hymn/History"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 79,
      "completed": false,
      "time_of_day": "Midday",
      "location": "Stream",
      "weather": "sunny",
      "verses": 13,
      "categories": [
        "Lament/Penitential"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 80,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 19,
      "categories": [
        "Lament/Penitential"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 81,
      "completed": false,
      "time_of_day": "Midday",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 16,
      "categories": [
        "Kingship-Covenant/Creator"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 82,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Waterfall",
      "weather": "sunny",
      "verses": 8,
      "categories": [
        "Lament/National/Penitential"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 83,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Hill",
      "weather": "cloudy",
      "verses": 18,
      "categories": [
        "Lament/National/Imprecatory"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 84,
      "completed": true,
      "time_of_day": "Midday",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 12,
      "categories": [
        "Praise hymn/Song of Zion"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 85,
      "completed": false,
      "time_of_day": "Midday",
      "location": "Lake",
      "weather": "sunny",
      "verses": 13,
      "categories": [
        "Lament/National", "Praise hymn"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 86,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "River",
      "weather": "sunny",
      "verses": 17,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 87,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Mountain Top",
      "weather": "sunny",
      "verses": 7,
      "categories": [
        "Praise hymn/Song of Zion"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 88,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "River",
      "weather": "sunny",
      "verses": 18,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 89,
      "completed": false,
      "time_of_day": "Midday",
      "location": "Mountain/Mountain Top",
      "weather": "sunny",
      "verses": 52,
      "categories": [
        "Kingship-Covenant/Thanksgiving"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 90,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Mountain/Mountain Top",
      "weather": "cloudy",
      "verses": 17,
      "categories": [
        "Lament/Penitential"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 91,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Woods/Forest",
      "weather": "sunny",
      "verses": 16,
      "categories": [
        "Song of Trust"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 92,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Waterfall",
      "weather": "sunny",
      "verses": 15,
      "categories": [
        "Thanksgiving/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 93,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Lake",
      "weather": "sunny",
      "verses": 5,
      "categories": [
        "Kingship-Covenant/Yahweh as Divine King"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 94,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "River",
      "weather": "sunny",
      "verses": 23,
      "categories": [
        "Lament/Penitential"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 95,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 11,
      "categories": [
        "Kingship-Covenant/Yahweh as Divine King", "Praise hymn/Yahweh as Divine King"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 96,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Woods/Forest",
      "weather": "sunny",
      "verses": 13,
      "categories": [
        "Kingship-Covenant/Yahweh as Divine King"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 97,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Mountain Top",
      "weather": "cloudy",
      "verses": 12,
      "categories": [
        "Kingship-Covenant/Yahweh as Divine King"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 98,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Ocean",
      "weather": "sunny",
      "verses": 9,
      "categories": [
        "Kingship-Covenant/Yahweh as Divine King", "Praise hymn/Yahweh as Divine King"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 99,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Hill",
      "weather": "sunny",
      "verses": 9,
      "categories": [
        "Kingship-Covenant/Yahweh as Divine King"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 100,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Stream in a meadow",
      "weather": "sunny",
      "verses": 5,
      "categories": [
        "Praise hymn/Deliverer"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 101,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Stream",
      "weather": "sunny",
      "verses": 8,
      "categories": [
        "Kingship-Covenant/Theocratic/Human King"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 102,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Waterfall",
      "weather": "sunny",
      "verses": 28,
      "categories": [
        "Lament/Penitential"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 103,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 22,
      "categories": [
        "Lament/Yahweh of History"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 104,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Woods/Forest",
      "weather": "sunny",
      "verses": 35,
      "categories": [
        "Praise hymn/Creator"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 105,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Mountain",
      "weather": "sunny",
      "verses": 45,
      "categories": [
        "Thanksgiving/Yahweh of History"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 106,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Mountain",
      "weather": "sunny",
      "verses": 48,
      "categories": [
        "Thanksgiving/Yahweh of History"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 107,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Mountain Top",
      "weather": "sunny",
      "verses": 43,
      "categories": [
        "Thanksgiving/National"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 108,
      "completed": false,
      "time_of_day": "Midday",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 13,
      "categories": [
        "Lament/Penitential"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 109,
      "completed": false,
      "time_of_day": "Morning",
      "location": "River",
      "weather": "sunny",
      "verses": 31,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 110,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Woods/Forest",
      "weather": "sunny",
      "verses": 7,
      "categories": [
        "Kingship-Covenant/Thanksgiving"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 111,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Lake",
      "weather": "sunny",
      "verses": 10,
      "categories": [
        "Praise hymn/Deliverer"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 112,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Waterfall",
      "weather": "sunny",
      "verses": 10,
      "categories": [
        "Wisdom"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 113,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Hill",
      "weather": "sunny",
      "verses": 9,
      "categories": [
        "Praise hymn/History"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 114,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Mountain",
      "weather": "sunny",
      "verses": 8,
      "categories": [
        "Praise hymn/Deliverer"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 115,
      "completed": false,
      "time_of_day": "Midday",
      "location": "Waterfall",
      "weather": "sunny",
      "verses": 18,
      "categories": [
        "Lament/Penitential"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 116,
      "completed": true,
      "time_of_day": "Midday",
      "location": "Woods/Forest",
      "weather": "sunny",
      "verses": 19,
      "categories": [
        "Thanksgiving/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 117,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Hill",
      "weather": "sunny",
      "verses": 2,
      "categories": [
        "Praise hymn/History"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 118,
      "completed": true,
      "time_of_day": "Midday",
      "location": "Waterfall",
      "weather": "sunny",
      "verses": 29,
      "categories": [
        "Thanksgiving/Individual", "Thanksgiving/National"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 119,
      "completed": false,
      "time_of_day": "Sunny",
      "location": "Various",
      "weather": "sunny",
      "verses": 176,
      "categories": [
        "Wisdom"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 120,
      "completed": false,
      "time_of_day": "Morning",
      "location": "River",
      "weather": "sunny",
      "verses": 7,
      "categories": [
        "Thanksgiving/Individual", "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 121,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Hill",
      "weather": "sunny",
      "verses": 8,
      "categories": [
        "Song of Trust"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 122,
      "completed": true,
      "time_of_day": "Midday",
      "location": "Hill",
      "weather": "sunny",
      "verses": 9,
      "categories": [
        "Praise hymn/Song of Zion"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 123,
      "completed": true,
      "time_of_day": "Morning",
      "location": "River",
      "weather": "sunny",
      "verses": 4,
      "categories": [
        "Lament/Penitential"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 124,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Stream",
      "weather": "sunny",
      "verses": 8,
      "categories": [
        "Thanksgiving/National"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 125,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Mountain Top",
      "weather": "sunny",
      "verses": 5,
      "categories": [
        "Song of Trust"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 126,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "River",
      "weather": "sunny",
      "verses": 6,
      "categories": [
        "Lament/Penitential"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 127,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Lake",
      "weather": "sunny",
      "verses": 5,
      "categories": [
        "Wisdom"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 128,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 6,
      "categories": [
        "Wisdom"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 129,
      "completed": false,
      "time_of_day": "Midday",
      "location": "Meadow",
      "weather": "sunny",
      "verses": 8,
      "categories": [
        "Thanksgiving/National", "Lament/Imprecatory"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 130,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Lake",
      "weather": "sunny",
      "verses": 8,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 131,
      "completed": true,
      "time_of_day": "Midday",
      "location": "Mountain Top",
      "weather": "sunny",
      "verses": 3,
      "categories": [
        "Song of Trust"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 132,
      "completed": true,
      "time_of_day": "Evening",
      "location": "Hill",
      "weather": "sunny",
      "verses": 18,
      "categories": [
        "Kingship-Covenant/Thanksgiving"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 133,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Ocean",
      "weather": "sunny",
      "verses": 3,
      "categories": [
        "Wisdom"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 134,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Mountain",
      "weather": "sunny",
      "verses": 3,
      "categories": [
        "Praise hymn"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 135,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Ocean",
      "weather": "sunny",
      "verses": 21,
      "categories": [
        "Praise hymn/History"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 136,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Mountain",
      "weather": "sunny",
      "verses": 26,
      "categories": [
        "Thanksgiving/National", "Praise hymn/History"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 137,
      "completed": false,
      "time_of_day": "Morning",
      "location": "River",
      "weather": "sunny",
      "verses": 9,
      "categories": [
        "Lament/Penitential/Imprecatory"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 138,
      "completed": true,
      "time_of_day": "Midday",
      "location": "River",
      "weather": "sunny",
      "verses": 8,
      "categories": [
        "Thanksgiving/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 139,
      "completed": true,
      "time_of_day": "Evening",
      "location": "Ocean",
      "weather": "sunny",
      "verses": 24,
      "categories": [
        "Wisdom", "Praise hymn"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 140,
      "completed": false,
      "time_of_day": "Morning",
      "location": "Lake",
      "weather": "sunny",
      "verses": 13,
      "categories": [
        "Lament/Individual/Imprecatory"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 141,
      "completed": true,
      "time_of_day": "Midday",
      "location": "Stream",
      "weather": "sunny",
      "verses": 10,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 142,
      "completed": true,
      "time_of_day": "Midday",
      "location": "Hill",
      "weather": "sunny",
      "verses": 7,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 143,
      "completed": false,
      "time_of_day": "Morning sunrise",
      "location": "Mountain Top",
      "weather": "sunny",
      "verses": 12,
      "categories": [
        "Lament/Individual"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 144,
      "completed": true,
      "time_of_day": "Morning",
      "location": "Woods/Forest",
      "weather": "sunny",
      "verses": 15,
      "categories": [
        "Kingship-Covenant/Thanksgiving", "Praise hymn"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 145,
      "completed": false,
      "time_of_day": "Midday",
      "location": "Lake",
      "weather": "sunny",
      "verses": 21,
      "categories": [
        "Praise hymn"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 146,
      "completed": true,
      "time_of_day": "Midday",
      "location": "Hill",
      "weather": "sunny",
      "verses": 10,
      "categories": [
        "Praise hymn"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 147,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Waterfall",
      "weather": "sunny",
      "verses": 20,
      "categories": [
        "Praise hymn"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 148,
      "completed": true,
      "time_of_day": "Afternoon",
      "location": "Mountain",
      "weather": "sunny",
      "verses": 14,
      "categories": [
        "Praise hymn"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 149,
      "completed": true,
      "time_of_day": "Midday",
      "location": "Woods/Forest",
      "weather": "sunny",
      "verses": 9,
      "categories": [
        "Praise hymn"
      ],
      "tags": [
        
      ]
    },
    {
      "psalm": 150,
      "completed": false,
      "time_of_day": "Afternoon",
      "location": "Waterfall",
      "weather": "sunny",
      "verses": 6,
      "categories": [
        "Praise hymn"
      ],
      "tags": [
        
      ]
    }
  ],
  "progress_log": [
    {
      "title": "Psalm 68",
      "date": "3/20/2026",
      "notes": "<a class='underline' href='/readings/68/'>Psalm 68</a> is now published."
    },
    {
      "title": "Psalm 139",
      "date": "3/15/2026",
      "notes": "<a class='underline' href='/readings/139/'>Psalm 139</a> is now published."
    },
    {
      "title": "Psalm 3",
      "date": "3/10/2026",
      "notes": "<a class='underline' href='/readings/3/'>Psalm 3</a> is now published."
    },
    {
      "title": "Psalm 133",
      "date": "4/5/2026",
      "notes": "<a class='underline' href='/readings/133/'>Psalm 133</a> is now published."
    },
    {
      "title": "Psalm 118",
      "date": "3/30/2026",
      "notes": "<a class='underline' href='/readings/118/'>Psalm 118</a> is now published."
    },
     {
      "title": "Psalm 4",
      "date": "3/25/2026",
      "notes": "<a class='underline' href='/readings/4/'>Psalm 4</a> is now published."
    },
    {
      "title": "Psalm 73",
      "date": "3/20/2026",
      "notes": "<a class='underline' href='/readings/73/'>Psalm 73</a> is now published."
    },
    {
      "title": "Psalm 142",
      "date": "3/15/2026",
      "notes": "<a class='underline' href='/readings/142/'>Psalm 142</a> is now published."
    },
    {
      "title": "Psalm 141",
      "date": "3/10/2026",
      "notes": "<a class='underline' href='/readings/141/'>Psalm 141</a> is now published."
    },
    {
      "title": "Psalm 87",
      "date": "3/5/2026",
      "notes": "<a class='underline' href='/readings/87/'>Psalm 87</a> is now published."
    },
    {
      "title": "Psalm 57",
      "date": "2/28/2026",
      "notes": "<a class='underline' href='/readings/57/'>Psalm 57</a> is now published."
    },
    {
      "title": "Psalm 56",
      "date": "2/25/2026",
      "notes": "<a class='underline' href='/readings/56/'>Psalm 56</a> is now published."
    },
    {
      "title": "Psalm 146",
      "date": "2/20/2026",
      "notes": "<a class='underline' href='/readings/146/'>Psalm 146</a> is now published."
    },
    {
      "title": "Psalm 113",
      "date": "2/18/2026",
      "notes": "<a class='underline' href='/readings/113/'>Psalm 113</a> is now published."
    },
    {
      "title": "Psalm 83",
      "date": "2/13/2026",
      "notes": "<a class='underline' href='/readings/83/'>Psalm 83</a> is now published."
    },
    {
      "title": "Psalm 132",
      "date": "2/8/2026",
      "notes": "<a class='underline' href='/readings/132/'>Psalm 132</a> is now published."
    },
    {
      "title": "Psalm 92",
      "date": "2/4/2026",
      "notes": "<a class='underline' href='/readings/92/'>Psalm 92</a> is now published."
    },
    {
      "title": "Psalm 52",
      "date": "1/30/2026",
      "notes": "<a class='underline' href='/readings/52/'>Psalm 52</a> is now published."
    },
    {
      "title": "Psalm 126",
      "date": "1/26/2026",
      "notes": "<a class='underline' href='/readings/126/'>Psalm 126</a> is now published."
    },
    {
      "title": "Psalm 148",
      "date": "1/22/2026",
      "notes": "<a class='underline' href='/readings/148/'>Psalm 148</a> is now published."
    },
    {
      "title": "Psalm 82",
      "date": "1/18/2026",
      "notes": "<a class='underline' href='/readings/82/'>Psalm 82</a> is now published."
    },
    {
      "title": "Psalm 45",
      "date": "1/14/2026",
      "notes": "<a class='underline' href='/readings/45/'>Psalm 45</a> is now published."
    },
    {
      "title": "Psalm 138",
      "date": "1/9/2026",
      "notes": "<a class='underline' href='/readings/138/'>Psalm 138</a> is now published."
    },
    {
      "title": "Psalm 43",
      "date": "1/5/2026",
      "notes": "<a class='underline' href='/readings/43/'>Psalm 43</a> is now published."
    },
    {
      "title": "Psalm 135",
      "date": "12/31/2025",
      "notes": "<a class='underline' href='/readings/135/'>Psalm 135</a> is now published."
    },
    {
      "title": "Psalm 34",
      "date": "12/28/2025",
      "notes": "<a class='underline' href='/readings/34/'>Psalm 34</a> is now published."
    },
    {
      "title": "Psalm 25",
      "date": "12/23/2025",
      "notes": "<a class='underline' href='/readings/25/'>Psalm 25</a> is now published."
    },
    {
      "title": "Psalm 21",
      "date": "12/16/2025",
      "notes": "<a class='underline' href='/readings/21/'>Psalm 21</a> is now published."
    },
    {
      "title": "Psalm 7",
      "date": "12/10/2025",
      "notes": "<a class='underline' href='/readings/7/'>Psalm 7</a> is now published."
    },
    {
      "title": "Psalm 106",
      "date": "12/5/2025",
      "notes": "<a class='underline' href='/readings/106/'>Psalm 106</a> is now published."
    },
    {
      "title": "Psalm 62",
      "date": "11/30/2025",
      "notes": "<a class='underline' href='/readings/62/'>Psalm 62</a> is now published."
    },
    {
      "title": "Psalm 28",
      "date": "11/26/2025",
      "notes": "<a class='underline' href='/readings/28/'>Psalm 28</a> is now published."
    },
    {
      "title": "Psalm 22",
      "date": "11/20/2025",
      "notes": "<a class='underline' href='/readings/22/'>Psalm 22</a> is now published."
    },
    {
      "title": "Psalm 14",
      "date": "11/16/2025",
      "notes": "<a class='underline' href='/readings/14/'>Psalm 14</a> is now published."
    },
    {
      "title": "Psalm 16",
      "date": "11/12/2025",
      "notes": "<a class='underline' href='/readings/16/'>Psalm 16</a> is now published."
    },
    {
      "title": "Psalm 122",
      "date": "11/8/2025",
      "notes": "<a class='underline' href='/readings/122/'>Psalm 122</a> is now published."
    },
    {
      "title": "Psalm 15",
      "date": "11/5/2025",
      "notes": "<a class='underline' href='/readings/15/'>Psalm 15</a> is now published."
    },
    {
      "title": "Psalm 5",
      "date": "11/1/2025",
      "notes": "<a class='underline' href='/readings/5/'>Psalm 5</a>, filmed in Oregon, is now published."
    },
    {
      "title": "Psalm 38",
      "date": "10/16/2025",
      "notes": "<a class='underline' href='/readings/38/'>Psalm 38</a> is now published."
    },
    {
      "title": "Psalm 104",
      "date": "7/25/2025",
      "notes": "<a class='underline' href='/readings/104/'>Psalm 104</a> is now published."
    },
    {
      "title": "Psalm 144",
      "date": "5/14/2025",
      "notes": "<a class='underline' href='/readings/144/'>Psalm 144</a> is now published."
    },
    {
      "title": "Psalm 105",
      "date": "3/16/2025",
      "notes": "<a class='underline' href='/readings/105/'>Psalm 105</a> is now published."
    },
    {
      "title": "Psalm 97",
      "date": "12/29/2024",
      "notes": "<a class='underline' href='/readings/97/'>Psalm 97</a> is now published."
    },
    {
      "title": "Psalm 78",
      "date": "11/27/2024",
      "notes": "<a class='underline' href='/readings/78/'>Psalm 78</a> is now published."
    },
    {
      "title": "Psalm 53",
      "date": "11/18/2024",
      "notes": "<a class='underline' href='/readings/53/'>Psalm 53</a>, filmed in the beautiful Blue Ridge of western North Carolina, is now published."
    },
    {
      "title": "Psalm 42",
      "date": "10/29/2024",
      "notes": "<a class='underline' href='/readings/42/'>Psalm 42</a>, filmed near a river on a beautiful day, is now published."
    },
    {
      "title": "Psalm 107",
      "date": "10/8/2024",
      "notes": "<a class='underline' href='/readings/107/'>Psalm 107</a>, our twentieth Psalm reading video, is now published."
    },
    {
      "title": "Psalm 69",
      "date": "9/25/2024",
      "notes": "<a class='underline' href='/readings/69/'>Psalm 69</a> is now published."
    },
    {
      "title": "Psalm 84",
      "date": "9/17/2024",
      "notes": "<a class='underline' href='/readings/84/'>Psalm 84</a>, our eighteenth Psalm video, is now published."
    },
    {
      "title": "Psalm 134",
      "date": "9/11/2024",
      "notes": "<a class='underline' href='/readings/134/'>Psalm 134</a>, is now published."
    },
    {
      "title": "Psalm 114",
      "date": "9/1/2024",
      "notes": "<a class='underline' href='/readings/114/'>Psalm 114</a>, is now published."
    },
    {
      "title": "Psalm 136",
      "date": "8/29/2024",
      "notes": "<a class='underline' href='/readings/136/'>Psalm 136</a>, is now published."
    },
    {
      "title": "Psalm 131",
      "date": "8/25/2024",
      "notes": "<a class='underline' href='/readings/131/'>Psalm 131</a>, a Song of Ascents by David, is now published. While we were reading, a deer came up close so we were able to include it in this Psalm video."
    },
    {
      "title": "Psalm 67",
      "date": "7/23/2024",
      "notes": "<a class='underline' href='/readings/67/'>Psalm 67</a>, is now published."
    },
    {
      "title": "Psalm 99",
      "date": "7/22/2024",
      "notes": "<a class='underline' href='/readings/99/'>Psalm 99</a>, a royal Psalm, is now published."
    },
    {
      "title": "Psalm 149",
      "date": "5/21/2024",
      "notes": "<a class='underline' href='/readings/149/'>Psalm 149</a> is now published. See if you can spot the squirrel who attempts to get some attention in the video!"
    },
    {
      "title": "Psalm 35",
      "date": "5/5/2024",
      "notes": "Our tenth Psalm reading, <a class='underline' href='/readings/35/'>Psalm 35</a> is published."
    },
    {
      "title": "Psalm 110",
      "date": "4/16/2024",
      "notes": "<a class='underline' href='/readings/110/'>Psalm 110</a>, a Psalm of David, is published."
    },
    {
      "title": "Psalm 30",
      "date": "4/14/2024",
      "notes": "<a class='underline' href='/readings/30/'>Psalm 30</a> is our eighth published video. It is really beginning to show signs of Spring in the north where we are at this time. We are excited to have the opportunity to film these readings through the change of seasons."
    },
    {
      "title": "Psalm location updates",
      "date": "4/2024",
      "notes": "I've gone through and categorized the Psalms. I also updated the website with organized locations where  we plan to film."
    },
    {
      "title": "Website updates",
      "date": "3/2024",
      "notes": "This website has been improved and updated."
    },
    {
      "title": "Psalm 49",
      "date": "3/2024",
      "notes": "Our seventh Psalm reading, <a class='underline' href='/readings/49/'>Psalm 49</a>, is now posted."
    },
    {
      "title": "Psalm 96",
      "date": "3/2024",
      "notes": "Our sixth Psalm reading, <a class='underline' href='/readings/96/'>Psalm 96</a>, set in the midst of cedar trees is now posted."
    },
    {
      "title": "Psalm 90",
      "date": "2/2024",
      "notes": "<a class='underline' href='/readings/90/'>Psalm 90</a>, our fifth Psalm reading is now posted."
    },
    {
      "title": "Psalm 13",
      "date": "2/2024",
      "notes": "Our fourth Psalm reading is now posted, <a class='underline' href='/readings/13/'>Psalm 13</a>. We filmed this reading on a foggy and frosty afternoon in the countryside of Minnesota. The combination of the thick fog, and frost on the grass had a unique feel."
    },
    {
      "title": "Audio files now available",
      "date": "2/2024",
      "notes": "The website now includes audio versions of each Psalm reading."
    },
    {
      "title": "Psalm 116",
      "date": "1/2024",
      "notes": "Another Psalm reading is now posted, <a class='underline' href='/readings/116/'>Psalm 116</a>. This is the first video to have the words of the Psalm appear near the bottom to help follow along with the Psalm reading."
    },
    {
      "title": "Psalm 26",
      "date": "12/2023",
      "notes": "The second Psalm reading is now posted, <a class='underline' href='/readings/26/'>Psalm 26</a>. This was a test video we had filmed before we had a good quality camera, but it turned out so nice that we decided to post it anyway."
    },
    {
      "title": "The first Psalm reading video!",
      "date": "10/2023",
      "notes": "The first Psalm reading video, <a class='underline' href='/readings/117/'>Psalm 117</a>, is now posted!"
    },
    {
      "title": "Test videos",
      "date": "8/2023",
      "notes": "We've recorded a number of videos to get a feel for the equipment and to practice reading the Psalms."
    },
    {
      "title": "Camera, audio equipment & gear",
      "date": "7/2023",
      "notes": "Praise Yahweh! He has provided us a professional-quality audio setup and a camera."
    },
    {
      "title": "Trial video & planning",
      "date": "7/2023",
      "notes": "We recorded a trial video to ensure we have what we need for camera and audio equipment. A lot of planning..."
    }
  ]
}